ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_BSSID_LIST</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RX_MISC_DEBUG,BLOB_LIBPP_HAL_HE_INIT_PREFIX]; CONFIDENCE[instruction-exact]. Canonical WDEVRXCTR_BSSIDLIST word. Complete dbg_read_rx_misc names bits 19:18 RXCTL9_BSSID_POS; the HE init prefix independently writes encoding two to that same field.</description>
      <baseAddress>0x20104110</baseAddress>
      <registers>
        <register><name>CONTROL</name><addressOffset>0x00</addressOffset><size>32</size><access>read-write</access><fields><field><name>LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>18</bitWidth></field><field><name>RX_CONTROL_9_BSSID_POSITION</name><description>SOURCE[BLOB_LIBPP_HAL_RX_MISC_DEBUG,BLOB_LIBPP_HAL_HE_INIT_PREFIX]; CONFIDENCE[instruction-exact]. Debug-decoded BSSID position field; complete hal_he_init writes encoding two.</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>20</bitOffset><bitWidth>12</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_CUSTOM_TYPE</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RX_MISC_DEBUG]; CONFIDENCE[instruction-exact]. WDEVTXRX_TAB three custom frame-type match and ACK-index profiles decoded by complete dbg_read_rx_misc.</description>
      <baseAddress>0x20104ca4</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>TYPE_2_ACK_INDEX</name><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>TYPE_2_VALUE</name><bitOffset>3</bitOffset><bitWidth>6</bitWidth></field><field><name>TYPE_2_ENABLE</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TYPE_1_ACK_INDEX</name><bitOffset>10</bitOffset><bitWidth>3</bitWidth></field><field><name>TYPE_1_VALUE</name><bitOffset>13</bitOffset><bitWidth>6</bitWidth></field><field><name>TYPE_1_ENABLE</name><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>TYPE_0_ACK_INDEX</name><bitOffset>20</bitOffset><bitWidth>3</bitWidth></field><field><name>TYPE_0_VALUE</name><bitOffset>23</bitOffset><bitWidth>6</bitWidth></field><field><name>TYPE_0_ENABLE</name><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>HIGH_UNKNOWN</name><bitOffset>30</bitOffset><bitWidth>2</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_STATISTICS</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RX_DEBUG_COUNTERS,HIL_OPEN_RX_STATISTICS_BASELINE_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Sparse RX hardware statistics decoded by complete dbg_read_rx_count. Ten-bit and sixteen-bit masks, the signed CFO transform and every register address below follow the complete instruction body and its pinned format string. Open HE HIL observed coherent MPDU/end/data, CFO, FCS, power-drop, HT-SIG, HE-SIG-A and interrupt counts while all buffer/FIFO/TKIP counters remained zero.</description>
      <baseAddress>0x2010430c</baseAddress>
      <registers>
        <register><name>MPDU_AND_CFO</name><description>WDEVRX_MPDU in bits 15:0. The blob sign-extends bits 31:16 and multiplies by 40 to print WDEVRX_CFO.</description><addressOffset>0x00</addressOffset><size>32</size><access>read-only</access><fields><field><name>MPDU_COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>CFO_ACCUMULATOR</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>BRX_ERROR_AGC</name><addressOffset>0x04</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>BRX_ERROR</name><addressOffset>0x08</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR</name><addressOffset>0x0c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_ABORT</name><addressOffset>0x10</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_AGC_EXIT</name><addressOffset>0x14</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_BASEBAND_OFF</name><addressOffset>0x18</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_FDM_WATCHDOG</name><addressOffset>0x1c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_POWER_DROP</name><addressOffset>0x20</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_RESTART</name><addressOffset>0x24</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_SERVICE</name><addressOffset>0x28</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_ERROR_TX_OVER</name><addressOffset>0x2c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_HE_UNSUPPORTED</name><addressOffset>0x30</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_HE_SIG_A_CRC</name><addressOffset>0x34</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_HE_FORMAT</name><addressOffset>0x38</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_HE_SIG_B_ERROR</name><addressOffset>0x3c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>NRX_HT_SIG_ERROR</name><addressOffset>0x40</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>NRX_UNSUPPORTED</name><addressOffset>0x44</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register>
        <register><name>SIGNAL_FIELD</name><description>WDEVRX_SF.</description><addressOffset>0x50</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>ABORT</name><addressOffset>0x54</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>FCS_PASS_COUNT</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>FCS_ERROR</name><addressOffset>0x58</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>FIFO_OVERFLOW</name><addressOffset>0x5c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>BUFFER_FULL</name><addressOffset>0x60</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>OTHER_UNICAST</name><addressOffset>0x64</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>TKIP_ERROR</name><addressOffset>0x68</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>SAME_BM_ERROR</name><addressOffset>0x6c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>ACK_INTERRUPT</name><addressOffset>0x70</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>RTS_INTERRUPT</name><addressOffset>0x74</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>CTS_INTERRUPT</name><description>SOURCE[BLOB_LIBPP_PP_DEBUG_HW_STATISTICS]; CONFIDENCE[instruction-exact]. Complete dbg_lmac_hw_statis_dump prints the full word at 0x20104384 as cts_int. Its internal field width is not inferred.</description><addressOffset>0x78</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DATA_SUCCESS</name><addressOffset>0x7c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>END</name><addressOffset>0x80</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>BT_BLOCK_ERROR</name><addressOffset>0x84</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>FREQUENCY_HOP_ERROR</name><addressOffset>0x88</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>LAST_UNMATCHED_ERROR</name><addressOffset>0x8c</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register>
        <register><name>TRIGGER</name><description>SOURCE[BLOB_LIBPP_PP_DEBUG_HW_STATISTICS]; CONFIDENCE[instruction-exact]. Complete dbg_lmac_hw_statis_dump prints the full word at 0x2010439c as trigger. This is a separate hardware-statistics observation from the decoded HE Trigger RX counter at 0x20104dbc.</description><addressOffset>0x90</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TX_STATISTICS</name>
      <description>SOURCE[BLOB_LIBPP_PP_DEBUG_HW_STATISTICS]; CONFIDENCE[instruction-exact]. Complete libpp.a[pp_debug.o]::dbg_lmac_hw_statis_dump reads these four consecutive words and prints them as txrts, txcts, track and trcts. It then reads the already canonical RX_TX_HANG/PANIC words at 0x20104e18/1c under its shorter txhung/panic labels. The blob applies no masks; the SVD therefore preserves each word without inventing subfields.</description>
      <baseAddress>0x20104e08</baseAddress>
      <registers>
        <register><name>TX_RTS</name><addressOffset>0x00</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>TX_CTS</name><addressOffset>0x04</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>TRACK</name><addressOffset>0x08</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>TRCTS</name><description>The abbreviated blob label is retained verbatim; its expansion is not yet proven.</description><addressOffset>0x0c</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_DIAGNOSTIC_STATISTICS</name>
      <description>SOURCE[BLOB_LIBPP_PP_DEBUG_DIAGNOSTIC_STATISTICS]; CONFIDENCE[instruction-exact]. Complete libpp.a[pp_debug.o]::dbg_lmac_diag_statis_dump ties the blob's diag0 through diag12 and diagsel labels to these sparse MMIO words. The non-contiguous geometry and absence of diag11 are properties of the complete body. Higher-level meanings and internal bit widths remain unknown.</description>
      <baseAddress>0x201043b4</baseAddress>
      <registers>
        <register><name>DIAG4</name><addressOffset>0x0000</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG5</name><addressOffset>0x0004</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG6</name><addressOffset>0x0008</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG7</name><addressOffset>0x000c</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG8</name><addressOffset>0x012c</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG9</name><addressOffset>0x0130</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG10</name><addressOffset>0x0134</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG12</name><addressOffset>0x0138</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG0</name><addressOffset>0x0a9c</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG1</name><addressOffset>0x0aa0</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG2</name><addressOffset>0x0aa4</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG3</name><addressOffset>0x0aac</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>DIAG_SELECT</name><addressOffset>0x0ab0</addressOffset><size>32</size><access>read-only</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_HANG_STATISTICS</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RX_DEBUG_COUNTERS,HIL_OPEN_RX_STATISTICS_BASELINE_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Complete dbg_read_rx_count decodes two eight-bit hang counters and two full-width combined hang/panic counters. All four remained zero during the connected open HE matrix baseline.</description>
      <baseAddress>0x20104c64</baseAddress>
      <registers>
        <register><name>HANG</name><addressOffset>0x00</addressOffset><size>32</size><access>read-only</access><fields><field><name>LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>TX_COUNT</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>RX_COUNT</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field></fields></register>
        <register><name>RX_TX_HANG</name><description>Complete dbg_read_rx_count names the combined counter RX_TX_HANG; complete pp_debug.o::dbg_lmac_hw_statis_dump independently reads the same full word under the shorter txhung label.</description><addressOffset>0x1b4</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>RX_TX_PANIC</name><description>Complete dbg_read_rx_count names the combined counter RX_TX_PANIC; complete pp_debug.o::dbg_lmac_hw_statis_dump independently reads the same full word under the shorter panic label.</description><addressOffset>0x1b8</addressOffset><size>32</size><access>read-only</access><fields><field><name>COUNT</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_MEMORY</name>
      <description>
        SOURCE[ROM_REV0_PHY_SET_PBUS_MEM,ROM_REV0_PHY_WRITE_PBUS_MEM,ROM_REV0_PHY_SAVE_PBUS_REG,BLOB_LIBPHY_PHY_SET_TX_CFR_MEM,ROM_REV0_PHY_WRITE_GAIN_MEM];
        CONFIDENCE[instruction-exact-partial].
        Shared PHY table-memory command, data and PBUS group-boundary aperture.
        The same command/data words have mode-dependent PBUS-memory, TX-CFR and
        gain-memory meanings; fields are named only where the complete bodies
        prove a common or mode-independent identity.
      </description>
      <baseAddress>0x20100800</baseAddress>
      <registers>
        <register>
          <name>COMMAND</name>
          <description>
            SOURCE[ROM_REV0_PHY_WRITE_PBUS_MEM,BLOB_LIBPHY_PHY_SET_TX_CFR_MEM,ROM_REV0_PHY_WRITE_GAIN_MEM];
            CONFIDENCE[instruction-exact-partial].
            Shared memory command. Bits 20:11 carry the widest evidenced PBUS
            memory command; gain-memory and TX-CFR use narrower subsets.
          </description>
          <addressOffset>0x44</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>GAIN_COMMAND_LOW_ZERO_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_WRITE_GAIN_MEM]; CONFIDENCE[instruction-exact-semantics-unknown]. Gain-memory writes clear bits 10:0; their individual meanings are unknown.</description>
              <bitOffset>0</bitOffset><bitWidth>11</bitWidth>
            </field>
            <field>
              <name>MEMORY_INDEX</name>
              <description>SOURCE[ROM_REV0_PHY_WRITE_PBUS_MEM,BLOB_LIBPHY_PHY_SET_TX_CFR_MEM,ROM_REV0_PHY_WRITE_GAIN_MEM]; CONFIDENCE[instruction-exact-partial]. Low eight bits of the PBUS command and complete CFR/gain memory index.</description>
              <bitOffset>11</bitOffset><bitWidth>8</bitWidth>
            </field>
            <field>
              <name>GAIN_WRITE_OR_PBUS_COMMAND_BIT_8</name>
              <description>SOURCE[ROM_REV0_PHY_WRITE_PBUS_MEM,ROM_REV0_PHY_WRITE_GAIN_MEM]; CONFIDENCE[instruction-exact-partial]. Gain-memory write selector or PBUS command bit 8.</description>
              <bitOffset>19</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PBUS_COMMAND_BIT_9</name>
              <description>SOURCE[ROM_REV0_PHY_WRITE_PBUS_MEM]; CONFIDENCE[instruction-exact]. PBUS command bit 9; CFR and gain-memory preserve it.</description>
              <bitOffset>20</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_CFR_COMMIT</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_SET_TX_CFR_MEM]; CONFIDENCE[instruction-exact]. TX-CFR entry commit pulse.</description>
              <bitOffset>21</bitOffset><bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_0</name>
          <description>SOURCE[ROM_REV0_PHY_WRITE_PBUS_MEM,BLOB_LIBPHY_PHY_SET_TX_CFR_MEM,ROM_REV0_PHY_WRITE_GAIN_MEM]; CONFIDENCE[instruction-exact-partial]. First shared table-memory data word; PBUS-memory and TX-CFR use only this word.</description>
          <addressOffset>0x48</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>OPAQUE_DATA</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>DATA_1</name>
          <description>SOURCE[ROM_REV0_PHY_WRITE_GAIN_MEM]; CONFIDENCE[instruction-exact-partial]. Second gain-memory data word.</description>
          <addressOffset>0x4c</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>OPAQUE_DATA</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>DATA_2</name>
          <description>SOURCE[ROM_REV0_PHY_WRITE_GAIN_MEM]; CONFIDENCE[instruction-exact-partial]. Third gain-memory data word.</description>
          <addressOffset>0x50</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>OPAQUE_DATA</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
