ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
        <register>
          <dim>6</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-5</dimIndex>
          <name>GROUP_BOUNDARY%s</name>
          <description>
            SOURCE[ROM_REV0_PHY_SET_PBUS_MEM,ROM_REV0_PHY_WRITE_PBUS_MEM,ROM_REV0_PHY_SAVE_PBUS_REG];
            CONFIDENCE[instruction-exact].
            Packed first/last entry indices for one even/odd PBUS-memory group
            pair. Six words describe all twelve groups.
          </description>
          <addressOffset>0x54</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>EVEN_GROUP_FIRST_ENTRY</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>EVEN_GROUP_LAST_ENTRY</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>ODD_GROUP_FIRST_ENTRY</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>ODD_GROUP_LAST_ENTRY</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>PHY_FREQUENCY_CHANNEL_ORACLE</name>
      <description>
        SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL,BLOB_LIBPHY_PHY_BB_INIT,BLOB_LIBPHY_REGISTER_CHIPV7_PHY];
        CONFIDENCE[instruction-exact-partial].
        Frequency-memory, hardware channel-switch, NRX and channel-bandwidth
        registers recovered from complete finite ROM/blob bodies. Names retain
        UNKNOWN where the instructions prove a field but not its electrical
        meaning. One physical word has one identity even when a bit has
        different mode-dependent roles.
      </description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>FREQUENCY_CONTROL</name>
          <description>
            SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL,BLOB_LIBPHY_REGISTER_CHIPV7_PHY];
            CONFIDENCE[instruction-exact-partial].
            Shared frequency module control word. Bit 18 is both the high bit
            of an eleven-bit command-memory address and the reset/release bit
            pulsed by phy_freq_module_resetn.
          </description>
          <addressOffset>0x001c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL_INDEX</name>
              <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact]. Complete phy_freq_chan_en_sw replaces the low byte with the caller's frequency-table index.</description>
              <bitOffset>0</bitOffset><bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMORY_ADDRESS_LOW_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact]. Low ten bits of the eleven-bit address selected by phy_freq_i2c_mem_write.</description>
              <bitOffset>8</bitOffset><bitWidth>10</bitWidth>
            </field>
            <field>
              <name>MEMORY_ADDRESS_HIGH_OR_MODULE_RESET_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact-partial]. High address bit during frequency-memory writes; independently cleared then set by complete phy_freq_module_resetn.</description>
              <bitOffset>18</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHANNEL_SWITCH_PULSE</name>
              <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact]. Complete phy_freq_chan_en_sw sets bit 19, delays one microsecond, then clears it.</description>
              <bitOffset>19</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MEMORY_WRITE_PULSE</name>
              <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact]. Complete phy_freq_i2c_mem_write sets then clears bit 20 after publishing data.</description>
              <bitOffset>20</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REGISTER_MODE_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_freq_reg_init replaces bits 29:22 with its two input nibbles; the electrical encoding is unknown.</description>
              <bitOffset>22</bitOffset><bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MODULE_ENABLE_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact]. Complete phy_freq_reg_init sets bit 30.</description>
              <bitOffset>30</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HARDWARE_FREQUENCY_DISABLE</name>
              <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL,BLOB_LIBPHY_REGISTER_CHIPV7_PHY]; CONFIDENCE[instruction-exact]. Complete phy_dis_hw_set_freq sets bit 31 before its two-microsecond delay; complete phy_en_hw_set_freq clears it.</description>
              <bitOffset>31</bitOffset><bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY_PARAMETER_0_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_freq_reg_init writes the full constant 0x19800249; no constituent electrical fields are public.</description>
          <addressOffset>0x0024</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>OPAQUE_VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>FREQUENCY_PARAMETER_1_STATUS</name>
          <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL,BLOB_LIBPHY_PHY_BB_INIT]; CONFIDENCE[instruction-exact-partial]. Complete phy_freq_reg_init writes 0x25824e58; phy_bb_init replaces the low baseband-mode field, and the open channel state machine samples bit 8 for the evidenced ready edge.</description>
          <addressOffset>0x0028</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>BASEBAND_MODE_UNKNOWN</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_BB_INIT]; CONFIDENCE[instruction-exact]. Complete phy_bb_init writes encoding two before calibration and zero after the initial channel setup.</description>
              <bitOffset>0</bitOffset><bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FREQUENCY_READY</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_RFPLL_CHANNEL]; CONFIDENCE[instruction-exact]. The complete channel parent samples bit 8 after the frequency-switch delay and branches on its asserted edge.</description>
              <bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY_MEMORY_DATA</name>
          <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact]. Data/mode word published by complete phy_freq_i2c_mem_write.</description>
          <addressOffset>0x002c</addressOffset><size>32</size><access>write-only</access>
          <fields>
            <field><name>DATA</name><bitOffset>0</bitOffset><bitWidth>24</bitWidth></field>
            <field><name>MODE</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>I2C_NUMBER_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact]. First two five-bit PHY-I2C number addresses packed by complete phy_freq_i2c_num_addr.</description>
          <addressOffset>0x0030</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>NUMBER_ADDRESS_0_UNKNOWN</name><bitOffset>8</bitOffset><bitWidth>5</bitWidth></field>
            <field><name>NUMBER_ADDRESS_1_UNKNOWN</name><bitOffset>13</bitOffset><bitWidth>5</bitWidth></field>
          </fields>
        </register>
        <register>
          <dim>3</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-2</dimIndex>
          <name>I2C_NUMBER_WORD%s</name>
          <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact]. Six consecutive five-bit PHY-I2C number addresses packed by complete phy_freq_num_get_data; unused slots are zero.</description>
          <addressOffset>0x0034</addressOffset><size>32</size><access>write-only</access>
          <fields>
            <field><name>NUMBER_ADDRESS_0_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field>
            <field><name>NUMBER_ADDRESS_1_UNKNOWN</name><bitOffset>5</bitOffset><bitWidth>5</bitWidth></field>
            <field><name>NUMBER_ADDRESS_2_UNKNOWN</name><bitOffset>10</bitOffset><bitWidth>5</bitWidth></field>
            <field><name>NUMBER_ADDRESS_3_UNKNOWN</name><bitOffset>15</bitOffset><bitWidth>5</bitWidth></field>
            <field><name>NUMBER_ADDRESS_4_UNKNOWN</name><bitOffset>20</bitOffset><bitWidth>5</bitWidth></field>
            <field><name>NUMBER_ADDRESS_5_UNKNOWN</name><bitOffset>25</bitOffset><bitWidth>5</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>FBW_BT_FILTER_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact-partial]. Shared filter-bandwidth and Bluetooth-filter word independently updated by complete phy_wifi_fbw_sel and phy_bt_filter_reg.</description>
          <addressOffset>0x0874</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>FBW_CLEAR_LOW_UNKNOWN</name><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBW_SELECT_MID_UNKNOWN</name><bitOffset>17</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>FBW_CLEAR_HIGH_UNKNOWN</name><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBW_SELECT_HIGH_UNKNOWN</name><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>BT_FILTER_LOW_UNKNOWN</name><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BT_FILTER_MODE_UNKNOWN</name><bitOffset>23</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>BT_FILTER_ENABLE_UNKNOWN</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_TX_OFFSET_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL,BLOB_LIBPP_HAL_HE_INIT_SUFFIX]; CONFIDENCE[instruction-exact-partial]. Canonical multifunction PHY/MAC word. Complete phy_mac_tx_chan_offset and phy_bb_cbw_chan_cfg update the low channel-offset field; complete hal_set_tx_min_pwr updates bits 9:4 and the HE init parent independently sets bit 17.</description>
          <addressOffset>0x4400</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>CHANNEL_OFFSET_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>MINIMUM_POWER_INDEX</name><description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_SUFFIX]; CONFIDENCE[instruction-exact]. Complete hal_set_tx_min_pwr(-11) writes signed six-bit value 0x35.</description><bitOffset>4</bitOffset><bitWidth>6</bitWidth></field><field><name>HE_PARENT_ENABLE_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_HE_INIT_SUFFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. The complete HE init parent sets bit 17 through a separate fresh-read RMW.</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>NRX_FREQUENCY_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact-partial]. NRX initialization and frequency quotient word. Complete phy_nrx_freq_set samples and preserves the high byte and writes a twenty-four-bit quotient. Initialization writes the same complete low twenty-four-bit region with its own image.</description>
          <addressOffset>0x7848</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>FREQUENCY_QUOTIENT_OR_INIT_LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>24</bitWidth></field>
            <field><name>SHIFT_LOW_OR_INIT_HIGH_UNKNOWN</name><bitOffset>24</bitOffset><bitWidth>5</bitWidth></field>
            <field><name>SHIFT_HIGH_UNKNOWN</name><bitOffset>29</bitOffset><bitWidth>3</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_CBW_CONTROL_0</name>
          <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL]; CONFIDENCE[instruction-exact]. Complete phy_bb_cbw_chan_cfg replaces the low two-bit CBW-derived field.</description>
          <addressOffset>0x7ce0</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>CBW_LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field></fields>
        </register>
        <register>
          <name>CHANNEL_CBW_CONTROL_1</name>
          <description>SOURCE[ROM_REV0_PHY_FREQUENCY_CHANNEL,ROM_REV0_PHY_CBW_FEATURE_WATCHDOG]; CONFIDENCE[instruction-exact]. Complete phy_bb_cbw_chan_cfg performs two fresh-read CBW-derived replacements; complete phy_vht_support independently replaces bit five.</description>
          <addressOffset>0x7ce4</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>CBW_LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>CBW_HIGH_UNKNOWN</name><bitOffset>2</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>VHT_SUPPORT</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
