ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>PHY_I2C_COMMAND_RAM</name>
      <description>
        SOURCE[ESP_IDF_ESP32S31_MODEM_REG_BASE,BLOB_LIBPHY_PHY_I2C,BLOB_LIBPHY_PHY_DEBUG_I2C];
        CONFIDENCE[instruction-exact]. Official S31
        reg_base.h names this aperture DR_REG_I2C_ANA_MST_MEM_BASE. The
        complete blob establishes its forty-five-entry command layout and the
        population order in phy_i2c_master_cmd_mem_init. Complete
        phy_i2c_check independently names ten logical banks, their block IDs,
        selected host and finite register-index ranges.
      </description>
      <baseAddress>0x2010fc00</baseAddress>
      <registers>
        <register>
          <dim>45</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-44</dimIndex>
          <name>COMMAND_MEMORY%s</name>
          <description>SOURCE[ESP_IDF_ESP32S31_MODEM_REG_BASE,BLOB_LIBPHY_PHY_I2C]; CONFIDENCE[instruction-exact]. One PHY-I2C master command-memory entry; the public header proves the containing memory aperture while the complete blob proves this word layout.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>write-only</access>
          <fields>
            <field>
              <name>BLOCK</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_DEBUG_I2C]; CONFIDENCE[instruction-exact]. Logical PHY-I2C block ID. The bank host and valid half-open register-index ranges are: SAR1 host 0 [0,7), ULP host 1 [0,11), RFPLL host 1 [0,22), RFPLL_SDM host 1 [0,7), BBPLL host 0 [0,11), BBTOP host 1 [0,57), PERIF host 0 [0,13), BIAS host 1 [0,4), TXRF host 1 [1,22), DIG_REG host 0 [0,15).</description>
              <bitOffset>0</bitOffset><bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue><name>SAR1</name><value>0x10</value></enumeratedValue>
                <enumeratedValue><name>ULP</name><value>0x61</value></enumeratedValue>
                <enumeratedValue><name>RFPLL</name><value>0x62</value></enumeratedValue>
                <enumeratedValue><name>RFPLL_SDM</name><value>0x63</value></enumeratedValue>
                <enumeratedValue><name>BBPLL</name><value>0x66</value></enumeratedValue>
                <enumeratedValue><name>BBTOP</name><value>0x67</value></enumeratedValue>
                <enumeratedValue><name>PERIF</name><value>0x69</value></enumeratedValue>
                <enumeratedValue><name>BIAS</name><value>0x6a</value></enumeratedValue>
                <enumeratedValue><name>TXRF</name><value>0x6b</value></enumeratedValue>
                <enumeratedValue><name>DIG_REG</name><value>0x6d</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field><name>REGISTER</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>DATA</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>PHY_AGC_ORACLE</name>
      <description>
        SOURCE[ROM_REV0_PHY_AGC,ROM_REV0_PHY_PBUS,ROM_REV0_PHY_ANT_INIT,BLOB_LIBPHY_PHY_DC_MEM_CLR,BLOB_LIBPHY_PHY_REG_UPDATE_NEW,BLOB_LIBPHY_PHY_SET_RX_GAIN_TABLE,BLOB_LIBPHY_PHY_SET_RX_COMP_NEW];
        CONFIDENCE[instruction-exact-semantics-unknown]. OPAQUE PHY AGC,
        PBus-pulse, antenna, RX-compensation, DC-memory, post-initialization
        and 11b-control registers recovered from complete, finite rev0
        ROM/blob bodies. One physical register has one identity even when
        independent bodies prove different fields. Names describe their
        proven operation role, not an unevidenced electrical identity.
      </description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>AGC_PARAMETER_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_agc_reg_init performs two fresh-read parameter-derived field replacements.</description>
          <addressOffset>0x08bc</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>PARAMETER_121_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. First update writes parameter byte 0x121 into bits 11:4.</description>
              <bitOffset>4</bitOffset><bitWidth>8</bitWidth>
            </field>
            <field>
              <name>PARAMETER_120_OFFSET_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Second update writes the low eight bits of parameter byte 0x120 plus 0x50 into bits 19:12.</description>
              <bitOffset>12</bitOffset><bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_SHARED_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_AGC,ROM_REV0_PHY_PBUS,ROM_REV0_PHY_FORCE_RX_GAIN,BLOB_LIBPHY_PHY_SET_RX_GAIN_TABLE,BLOB_LIBPHY_PHY_SET_RX_COMP_NEW]; CONFIDENCE[instruction-exact-semantics-unknown]. Shared word updated by complete phy_agc_reg_init, phy_enable_agc, phy_pbus_force_mode, phy_force_rx_gain, phy_set_rx_comp_new, and the final limit tail of phy_set_rx_gain_table.</description>
          <addressOffset>0x702c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>RX_COMPENSATION_LOW_UNKNOWN</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_SET_RX_COMP_NEW]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_set_rx_comp_new writes 0xed into bits 7:0.</description>
              <bitOffset>0</bitOffset><bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RX_GAIN_INDEX_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC,BLOB_LIBPHY_PHY_SET_RX_GAIN_TABLE]; CONFIDENCE[instruction-exact-semantics-unknown]. Bits 14:8 receive parameter byte 0x121 during AGC initialization and the final Wi-Fi RX gain index after table publication.</description>
              <bitOffset>8</bitOffset><bitWidth>7</bitWidth>
            </field>
            <field>
              <name>PULSE_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC,ROM_REV0_PHY_PBUS,ROM_REV0_PHY_FORCE_RX_GAIN]; CONFIDENCE[instruction-exact-semantics-unknown]. Bit 23 is pulsed by complete phy_enable_agc and by the delayed tail of phy_pbus_force_mode; complete phy_force_rx_gain replaces it with the caller low bit.</description>
              <bitOffset>23</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONTROL_HIGH_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC,ROM_REV0_PHY_PBUS,ROM_REV0_PHY_FORCE_RX_GAIN]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_agc_reg_init and the delayed phy_pbus_force_mode tail write 0x32 into bits 31:24 before pulsing bit 23; complete phy_force_rx_gain replaces the byte with its second argument.</description>
              <bitOffset>24</bitOffset><bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_ANTENNA_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_AGC,ROM_REV0_PHY_ANT_INIT,ROM_REV0_PHY_CBW_FEATURE_WATCHDOG]; CONFIDENCE[instruction-exact-semantics-unknown]. Shared word updated independently by complete AGC enable/disable, antenna initialization and frequency-band selection bodies.</description>
          <addressOffset>0x7030</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>FREQUENCY_BAND_INVERSE</name>
              <description>SOURCE[ROM_REV0_PHY_CBW_FEATURE_WATCHDOG]; CONFIDENCE[instruction-exact]. Complete phy_freq_band_reg_set writes the inverse of the caller low bit.</description>
              <bitOffset>5</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ANTENNA_INIT_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_ANT_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_ant_init writes 0x34 into bits 17:11.</description>
              <bitOffset>11</bitOffset><bitWidth>7</bitWidth>
            </field>
            <field>
              <name>AGC_DISABLE_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Instruction-exact AGC disable/enable gate.</description>
              <bitOffset>29</bitOffset><bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSI_DUMP_FORCE_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_CBW_FEATURE_WATCHDOG]; CONFIDENCE[instruction-exact]. Complete phy_csidump_force_lltf_cfg replaces bit fifteen from the caller low bit.</description>
          <addressOffset>0x70a4</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>FORCE_LLTF</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>DC_MEMORY_CONTROL</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_DC_MEM_CLR]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_dc_mem_clr sets then clears bit 20 using a fresh read before each write.</description>
          <addressOffset>0x703c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>CLEAR_PULSE_UNKNOWN</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_DC_MEM_CLR]; CONFIDENCE[instruction-exact-semantics-unknown]. Instruction-exact set/clear pulse; the vendor symbol qualifies the operation while the electrical effect remains unknown.</description>
              <bitOffset>20</bitOffset><bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_11B_PATH_CONTROL_0</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update writes the full word; complete phy_rx_11b_opt later replaces two six-bit fields.</description>
          <addressOffset>0x7044</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>RX_11B_LOW_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_rx_11b_opt replaces bits 13:8.</description>
              <bitOffset>8</bitOffset><bitWidth>6</bitWidth>
            </field>
            <field>
              <name>RX_11B_HIGH_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_rx_11b_opt replaces bits 21:16.</description>
              <bitOffset>16</bitOffset><bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_UPDATE_7048_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update writes 0xff7da4f3.</description>
          <addressOffset>0x7048</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>AGC_SATURATION_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_AGC,BLOB_LIBPHY_PHY_REG_UPDATE_NEW]; CONFIDENCE[instruction-exact-semantics-unknown]. Shared word updated by complete phy_agc_reg_init, both phy_rfrx_sat_rst branches, and phy_reg_update_new.</description>
          <addressOffset>0x705c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Bits 18:0 receive 0xbb8 during AGC initialization and 0x400 or 0x800 in the two RF RX saturation phases.</description>
              <bitOffset>0</bitOffset><bitWidth>19</bitWidth>
            </field>
            <field>
              <name>RF_RX_SATURATION_BIT_19_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. One member of the discontiguous 0xd1080000 mask set or cleared by phy_rfrx_sat_rst.</description>
              <bitOffset>19</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RF_RX_SATURATION_BIT_24_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. One member of the discontiguous 0xd1080000 mask set or cleared by phy_rfrx_sat_rst.</description>
              <bitOffset>24</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POST_INIT_SET_UNKNOWN</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_REG_UPDATE_NEW]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_reg_update_new sets bit 26.</description>
              <bitOffset>26</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RF_RX_SATURATION_BIT_28_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. One member of the discontiguous 0xd1080000 mask set or cleared by phy_rfrx_sat_rst.</description>
              <bitOffset>28</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RF_RX_SATURATION_HIGH_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Bits 31:30 are the adjacent high pair in the discontiguous 0xd1080000 mask set or cleared by phy_rfrx_sat_rst.</description>
              <bitOffset>30</bitOffset><bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SATURATION_GAIN_LOW</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_REG_UPDATE_NEW]; CONFIDENCE[instruction-exact]. Complete rev0 ROM phy_wifi_agc_sat_gain writes its argument here first.</description>
          <addressOffset>0x7064</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>RF_RX_SATURATION_CONFIG</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_rfrx_sat_rst writes the full value 0x00000404 before either branch.</description>
          <addressOffset>0x7068</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>AGC_GAIN_LIMIT_LOW</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_agc_reg_init replaces one seven-bit parameter-derived field.</description>
          <addressOffset>0x7094</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>PARAMETER_MINUS_ONE_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Bits 8:2 receive the low seven bits of parameter byte 0x121 minus one.</description>
              <bitOffset>2</bitOffset><bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_COMPENSATION_HIGH_CONTROL</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_SET_RX_COMP_NEW]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_set_rx_comp_new performs its second fresh-read update here.</description>
          <addressOffset>0x70a0</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>RX_COMPENSATION_HIGH_UNKNOWN</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_SET_RX_COMP_NEW]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_set_rx_comp_new writes 0xed into bits 31:24.</description>
              <bitOffset>24</bitOffset><bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_11B_WINDOW_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_AGC,BLOB_LIBPHY_PHY_REG_UPDATE_NEW]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update writes the full word; phy_rx_11b_opt and phy_reg_update_new replace the same low nine-bit field with independently evidenced values.</description>
          <addressOffset>0x7104</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>WINDOW_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC,BLOB_LIBPHY_PHY_REG_UPDATE_NEW]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_rx_11b_opt writes 0x1c8 and complete phy_reg_update_new writes 0x1c0 into bits 8:0.</description>
              <bitOffset>0</bitOffset><bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SATURATION_GAIN_HIGH</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_REG_UPDATE_NEW]; CONFIDENCE[instruction-exact]. Complete rev0 ROM phy_wifi_agc_sat_gain writes its argument here second.</description>
          <addressOffset>0x7114</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>ANTENNA_CONTROL_0</name>
          <description>SOURCE[ROM_REV0_PHY_ANT_INIT,ROM_REV0_PHY_ANT_DFT_CFG]; CONFIDENCE[instruction-exact-semantics-unknown]. First fresh-read update of complete phy_ant_init clears two independently evidenced field groups; complete phy_ant_dft_cfg replaces bit 11 with its caller low bit.</description>
          <addressOffset>0x711c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>LOW_CLEAR_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_ANT_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_ant_init clears bits 10:0.</description>
              <bitOffset>0</bitOffset><bitWidth>11</bitWidth>
            </field>
            <field>
              <name>ANTENNA_DIVERSITY_ENABLE_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_ANT_DFT_CFG]; CONFIDENCE[instruction-exact]. Complete phy_ant_dft_cfg replaces bit 11 with its caller low bit.</description>
              <bitOffset>11</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT_12_CLEAR_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_ANT_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_ant_init independently clears bit 12.</description>
              <bitOffset>12</bitOffset><bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ANTENNA_CONTROL_2</name>
          <description>SOURCE[ROM_REV0_PHY_ANT_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. Third fresh-read update of complete phy_ant_init writes the same value into two separated bytes.</description>
          <addressOffset>0x7120</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_ANT_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_ant_init writes 0x1e into bits 15:8.</description>
              <bitOffset>8</bitOffset><bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_ANT_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_ant_init writes 0x1e into bits 31:24.</description>
              <bitOffset>24</bitOffset><bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_11B_PATH_CONTROL_1</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update writes the full word; complete phy_rx_11b_opt later replaces two fields.</description>
          <addressOffset>0x7124</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>RX_11B_LOW_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_rx_11b_opt replaces bits 3:0.</description>
              <bitOffset>0</bitOffset><bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RX_11B_HIGH_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_rx_11b_opt replaces bits 15:10.</description>
              <bitOffset>10</bitOffset><bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_INIT_HIGH_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_AGC,BLOB_LIBPP_HAL_HE_INIT_PREFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Canonical multifunction word. Complete phy_agc_reg_init replaces the high byte with 0xd2; complete hal_init_bf later performs one volatile full-word synchronization/status read whose value is unused.</description>
          <addressOffset>0x7128</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>INIT_HIGH_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Instruction-exact 0xd2 value in bits 31:24.</description>
              <bitOffset>24</bitOffset><bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_GAIN_LIMIT_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_AGC,BLOB_LIBPHY_PHY_SET_RX_GAIN_TABLE]; CONFIDENCE[instruction-exact-semantics-unknown]. Shared seven-bit gain limit written by phy_agc_reg_init and the final phy_set_rx_gain_table tail.</description>
          <addressOffset>0x713c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>RX_GAIN_LIMIT_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC,BLOB_LIBPHY_PHY_SET_RX_GAIN_TABLE]; CONFIDENCE[instruction-exact-semantics-unknown]. Bits 24:18 receive parameter byte 0x121 minus one during initialization and the final Wi-Fi index capped at 0x4c after table publication.</description>
              <bitOffset>18</bitOffset><bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_UPDATE_78A4_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update writes 0x0001721f.</description>
          <addressOffset>0x78a4</addressOffset><size>32</size><access>write-only</access>
        </register>
