ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
        <register>
          <name>POST_INIT_RX_CONTROL</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_REG_UPDATE_NEW]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_reg_update_new performs two fresh-read field replacements in this order.</description>
          <addressOffset>0x78c8</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>LOW_UNKNOWN</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_REG_UPDATE_NEW]; CONFIDENCE[instruction-exact-semantics-unknown]. First fresh-read update replaces bits 6:0 with 0x17.</description>
              <bitOffset>0</bitOffset><bitWidth>7</bitWidth>
            </field>
            <field>
              <name>HIGH_UNKNOWN</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_REG_UPDATE_NEW]; CONFIDENCE[instruction-exact-semantics-unknown]. Second fresh-read update replaces bits 13:7 with 0x17.</description>
              <bitOffset>7</bitOffset><bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FTM_CONTROL</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_REG_UPDATE_NEW]; CONFIDENCE[instruction-exact]. Complete phy_set_ftm_en replaces bit zero with its one-bit argument.</description>
          <addressOffset>0x7d4c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_REG_UPDATE_NEW]; CONFIDENCE[instruction-exact]. One-bit FTM enable argument.</description>
              <bitOffset>0</bitOffset><bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_11B_MODE_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update clears bit 26; complete phy_rx_11b_opt replaces bits 15:12.</description>
          <addressOffset>0x8004</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>RX_11B_MODE_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_rx_11b_opt replaces bits 15:12.</description>
              <bitOffset>12</bitOffset><bitWidth>4</bitWidth>
            </field>
            <field>
              <name>BB_AGC_UPDATE_CLEAR_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update clears bit 26.</description>
              <bitOffset>26</bitOffset><bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_UPDATE_8010_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update writes 0x000852a1.</description>
          <addressOffset>0x8010</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_8018_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update writes 0x00600030.</description>
          <addressOffset>0x8018</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_801C_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update writes 0x010000a0.</description>
          <addressOffset>0x801c</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_8020_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update writes 0x00000180.</description>
          <addressOffset>0x8020</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_8028_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update writes 0xc0403020.</description>
          <addressOffset>0x8028</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_802C_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update writes 0x01000080.</description>
          <addressOffset>0x802c</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_8070_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update writes 0x000008c7.</description>
          <addressOffset>0x8070</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>AGC_UPDATE_8078_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update sets bits 22:20.</description>
          <addressOffset>0x8078</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>BB_AGC_UPDATE_SET_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_AGC]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_agc_reg_update sets all three bits.</description>
              <bitOffset>20</bitOffset><bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW_RATE_PRIMARY_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_LOW_RATE,ROM_REV0_PHY_RX11BLR_CFG]; CONFIDENCE[instruction-exact]. Complete phy_enable_low_rate sets bits 10 and 11 through separate fresh-read RMW edges; complete phy_disable_low_rate clears them in the same order; complete phy_rx11blr_cfg replaces both with its caller low bit.</description>
          <addressOffset>0x8060</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>LOW_RATE_ENABLE_FIRST</name><description>SOURCE[ROM_REV0_PHY_LOW_RATE]; CONFIDENCE[instruction-exact]. First independently updated low-rate enable bit.</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LOW_RATE_ENABLE_SECOND</name><description>SOURCE[ROM_REV0_PHY_LOW_RATE]; CONFIDENCE[instruction-exact]. Second independently updated low-rate enable bit.</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>LOW_RATE_SECONDARY_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_LOW_RATE,ROM_REV0_PHY_RX11BLR_CFG]; CONFIDENCE[instruction-exact]. Third and final fresh-read RMW in the complete low-rate leaves and phy_rx11blr_cfg.</description>
          <addressOffset>0x807c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>LOW_RATE_ENABLE</name><description>SOURCE[ROM_REV0_PHY_LOW_RATE]; CONFIDENCE[instruction-exact]. Set by complete phy_enable_low_rate and cleared by complete phy_disable_low_rate.</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
