ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>PHY_BASEBAND_CONFIG_ORACLE</name>
      <description>
        SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,ROM_REV0_PHY_POWER_DETECTOR,
        ROM_REV0_PHY_IQ_COEFFICIENTS,BLOB_LIBPHY_PHY_BASEBAND_CONFIG];
        CONFIDENCE[instruction-exact-partial].
        PHY/baseband configuration registers recovered from complete rev0 ROM
        bodies and complete pinned libphy leaves. Operation-derived fields keep
        UNKNOWN where neither public documentation nor an independent symbol
        establishes the electrical meaning.
      </description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>FRONT_END_AND_TONE_STOP_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_FE_REG_INIT,ROM_REV0_PHY_START_STOP_TX_TONE]; CONFIDENCE[instruction-exact]. Shared word whose bit 2 is set by complete phy_fe_reg_init. Complete phy_start_tx_tone_step clears bits 1:0 and complete phy_stop_tx_tone sets them.</description>
          <addressOffset>0x040c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>TONE_STOP_CONTROL_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_START_STOP_TX_TONE]; CONFIDENCE[instruction-exact]. Two-bit field cleared before the ROM power-control tone and set by its complete cleanup; the individual bit meanings are unknown.</description>
              <bitOffset>0</bitOffset><bitWidth>2</bitWidth>
            </field>
            <field><name>FRONT_END_INIT_ENABLE_UNKNOWN</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>TX_GAIN_COMPENSATION</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_BASEBAND_CONFIG]; CONFIDENCE[instruction-exact]. Complete phy_txgain_comp_pacfg_new(1) publishes four ordered byte updates.</description>
          <addressOffset>0x0410</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>COMPENSATION_BYTE_0_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>COMPENSATION_BYTE_1_UNKNOWN</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>COMPENSATION_BYTE_2_UNKNOWN</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>COMPENSATION_BYTE_3_UNKNOWN</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>TX_GAIN_COMPENSATION_AUX</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_START_TX_TONE_STEP_NEW]; CONFIDENCE[instruction-exact-semantics-unknown]. Pinned _oracles/libphy.a[phy_reg.o] phy_start_tx_tone_step_new writes the full zero image while disabling TX-gain compensation.</description>
          <addressOffset>0x0414</addressOffset><size>32</size><access>write-only</access>
          <fields>
            <field><name>AUXILIARY_IMAGE_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>TX_DC_MEASUREMENT_CONTROL_STATUS</name>
          <description>SOURCE[ROM_REV0_PHY_TXDC_CAL]; CONFIDENCE[instruction-exact]. Complete phy_txdc_cal triggers measurement with bits 1 and 0, polls ready bit 22, samples I and Q comparator bits 29 and 28 through independent reads, then clears bits 1 and 0.</description>
          <addressOffset>0x0418</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>MEASUREMENT_START</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MEASUREMENT_ENABLE</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MEASUREMENT_READY</name><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field>
            <field><name>Q_COMPARATOR_HIGH</name><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field>
            <field><name>I_COMPARATOR_HIGH</name><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field>
          </fields>
        </register>
        <register>
          <name>TONE_PATH_0_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_START_STOP_TX_TONE,ROM_REV0_PHY_TXIQ_GET_MIS_PWR,BLOB_LIBPHY_PHY_START_TX_TONE_STEP_NEW]; CONFIDENCE[instruction-exact-partial]. First calibration-tone path word. Complete source bodies prove the packed selector, negated step or attenuation, enable/arm bit and TX-IQ mismatch images; the high nibble is preserved and remains electrically unknown.</description>
          <addressOffset>0x041c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>SELECTOR_HIGH</name><description>Upper eight bits of the evidenced ten-bit selector; bits 1:0 are in TONE_SELECTOR_CONTROL.</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>LOW_RESERVED_CLEAR_UNKNOWN</name><description>Complete tone writers clear these bits; their hardware meaning is unknown.</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>NEGATED_STEP_OR_ATTENUATION</name><description>Two's-complement negated eight-bit tone step or attenuation.</description><bitOffset>10</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>TONE_ENABLE_OR_ARM</name><description>Set by tone start and by each PWDET sample-arm edge; cleared by stop and sample cleanup.</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TXIQ_MISMATCH_MODE_UNKNOWN</name><description>SOURCE[ROM_REV0_PHY_TXIQ_GET_MIS_PWR]; CONFIDENCE[instruction-exact-semantics-unknown]. Three-bit image set to binary 101 for the first mismatch-power polarity and otherwise cleared by general tone setup.</description><bitOffset>19</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>MIDDLE_RESERVED_CLEAR_UNKNOWN</name><description>Complete general and first-polarity tone writers clear these bits.</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>TXIQ_POLARITY_IMAGE</name><description>SOURCE[ROM_REV0_PHY_TXIQ_GET_MIS_PWR]; CONFIDENCE[instruction-exact]. Four-bit mismatch polarity image: first configuration writes bit 26, while the second phase writes nibble 1 or 8.</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field>

          </fields>
        </register>
        <register>
          <name>TONE_PATH_1_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_START_STOP_TX_TONE,BLOB_LIBPHY_PHY_START_TX_TONE_STEP_NEW]; CONFIDENCE[instruction-exact-partial]. Second calibration-tone path word. All currently evidenced calls publish a disabled zero low image while preserving the high nibble.</description>
          <addressOffset>0x0420</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>SELECTOR_HIGH</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>LOW_RESERVED_CLEAR_UNKNOWN</name><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>NEGATED_STEP_OR_ATTENUATION</name><bitOffset>10</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>TONE_ENABLE_OR_ARM</name><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LOW_IMAGE_REMAINDER_UNKNOWN</name><bitOffset>19</bitOffset><bitWidth>9</bitWidth></field>

          </fields>
        </register>
        <register>
          <name>RX_GAIN_DC_CONTROL</name>
          <description>
            SOURCE[ROM_REV0_PHY_SET_RX_GAIN_CAL_DC]; CONFIDENCE[instruction-exact].
            Complete rev0 ROM phy_set_rx_gain_cal_dc at 0x2f829858, size
            0x206, sets bits 6:5 before the bounded RX-gain DC calibration
            graph and clears the same pair during the common cleanup tail.
            Their narrower electrical meaning is not independently proved.
          </description>
          <addressOffset>0x0424</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>CALIBRATION_ENABLE_UNKNOWN</name>
              <bitOffset>5</bitOffset><bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Common phy_set_rx_gain_cal_dc cleanup value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>phy_set_rx_gain_cal_dc calibration-prefix value.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TONE_SELECTOR_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_START_TX_TONE_STEP,ROM_REV0_PHY_TXIQ_GET_MIS_PWR,BLOB_LIBPHY_PHY_START_TX_TONE_STEP_NEW]; CONFIDENCE[instruction-exact]. Low two selector bits for each calibration-tone path, updated through separate fresh-read edges.</description>
          <addressOffset>0x0428</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>PATH_0_SELECTOR_LOW</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>PATH_1_SELECTOR_LOW</name><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>IQ_CORRECTION_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,ROM_REV0_PHY_IQ_COEFFICIENTS,BLOB_LIBPHY_PHY_RXIQ_CAL_INIT]; CONFIDENCE[instruction-exact]. Shared RX-IQ coefficient and correction-mode word.</description>
          <addressOffset>0x0438</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>RX_IQ_GAIN_COEFFICIENT</name><bitOffset>16</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>RX_IQ_PHASE_COEFFICIENT</name><bitOffset>22</bitOffset><bitWidth>7</bitWidth></field>
            <field>
              <name>RX_IQ_CORRECTION_MODE_LOW</name>
              <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,BLOB_LIBPHY_PHY_RXIQ_CAL_INIT]; CONFIDENCE[instruction-exact]. Low bit of the correction-mode field updated through a distinct fresh-read edge by the RXIQ parent.</description>
              <bitOffset>29</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_IQ_CORRECTION_MODE_HIGH</name>
              <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,BLOB_LIBPHY_PHY_RXIQ_CAL_INIT]; CONFIDENCE[instruction-exact]. High bit of the correction-mode field updated through a distinct fresh-read edge by the RXIQ parent.</description>
              <bitOffset>30</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRONT_END_INIT_HIGH_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_FE_REG_INIT]; CONFIDENCE[instruction-exact]. Complete phy_fe_reg_init sets bit 31 after the repeated ADC-control writes.</description>
              <bitOffset>31</bitOffset><bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FRONT_END_CLEAR_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_FE_REG_INIT]; CONFIDENCE[instruction-exact]. Complete phy_fe_reg_init clears bits 8 and 11 in two separately ordered RMW edges.</description>
          <addressOffset>0x0444</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>INIT_CLEAR_FIRST_UNKNOWN</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>INIT_CLEAR_SECOND_UNKNOWN</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>ADC_RATE_AND_FRONT_END_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_ADC_RATE,ROM_REV0_PHY_DAC_RATE,ROM_REV0_PHY_FE_REG_INIT,BLOB_LIBPHY_PHY_FE_REG_UPDATE]; CONFIDENCE[instruction-exact]. Complete phy_adc_rate_set and phy_dac_rate_set publish rate bit zero into bits 1 and 0 through separate RMW edges. Front-end initialization and update set the same bits in their independently evidenced order.</description>
          <addressOffset>0x0448</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>ADC_RATE_LOW_OR_FRONT_END_CONTROL_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ADC_RATE_HIGH_OR_FRONT_END_CONTROL_UNKNOWN</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_POWER_DETECTOR,BLOB_LIBPHY_PHY_TXDC_PWDET]; CONFIDENCE[instruction-exact]. Shared PWDET trigger, calibration and background-control word.</description>
          <addressOffset>0x0808</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>SAR_TRIGGER</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ENABLE_CLEAR_UNKNOWN</name><bitOffset>1</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>CALIBRATION_FIELD_UNKNOWN</name><bitOffset>4</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>BACKGROUND_CONTROL_ENABLE_UNKNOWN</name><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>INITIALIZATION_MODE_UNKNOWN</name><bitOffset>20</bitOffset><bitWidth>3</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_SAR_CONTROL_STATUS</name>
          <description>SOURCE[ROM_REV0_PHY_POWER_DETECTOR,BLOB_LIBPHY_PHY_TXDC_PWDET]; CONFIDENCE[instruction-exact]. PWDET SAR configuration and three-bit ready status.</description>
          <addressOffset>0x080c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>SAR_CONFIG_CLEAR_UNKNOWN</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SAR_MODE_UNKNOWN</name><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>SAR_READY</name><description>SOURCE[ROM_REV0_PHY_POWER_DETECTOR,BLOB_LIBPHY_PHY_TXDC_PWDET]; CONFIDENCE[instruction-exact]. Hardware completion state sampled by the complete power-detector paths; neither source writes these bits.</description><bitOffset>14</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_TABLE_0_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_POWER_DETECTOR]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_pwdet_reg_init writes 0x0f0f0fff.</description>
          <addressOffset>0x0810</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>POWER_DETECTOR_TABLE_1</name>
          <description>SOURCE[ROM_REV0_PHY_POWER_DETECTOR,BLOB_LIBPHY_PHY_TXDC_PWDET]; CONFIDENCE[instruction-exact-partial]. Complete initialization writes 0x00ff0f64; TX-DC calibration temporarily replaces the low byte.</description>
          <addressOffset>0x0814</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TX_DC_TEMPORARY_LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>INITIALIZATION_HIGH_UNKNOWN</name><bitOffset>8</bitOffset><bitWidth>16</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_REFERENCE</name>
          <description>SOURCE[ROM_REV0_PHY_POWER_DETECTOR]; CONFIDENCE[instruction-exact]. PWDET reference word; initialization writes 0xaaaa and later paths publish 0, 0x5555 or 0xaaaa.</description>
          <addressOffset>0x0818</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>REFERENCE_CODE</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields>
        </register>
        <register>
          <name>POWER_DETECTOR_SAR_RESULT</name>
          <description>SOURCE[ROM_REV0_PHY_POWER_DETECTOR]; CONFIDENCE[instruction-exact]. First of four consecutive SAR result words. phy_get_tone_sar_dout_ consumes its upper thirteen-bit sample; phy_get_fm_sar_dout consumes both thirteen-bit halves from all four words.</description>
          <addressOffset>0x081c</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>SAR_SAMPLE_LOW</name><bitOffset>1</bitOffset><bitWidth>13</bitWidth></field>
            <field><name>SAR_SAMPLE</name><bitOffset>17</bitOffset><bitWidth>13</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_SAR_RESULT_1</name>
          <description>SOURCE[ROM_REV0_PHY_POWER_DETECTOR]; CONFIDENCE[instruction-exact]. Second of four consecutive dual thirteen-bit SAR result words consumed by complete phy_get_fm_sar_dout.</description>
          <addressOffset>0x0820</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>SAR_SAMPLE_LOW</name><bitOffset>1</bitOffset><bitWidth>13</bitWidth></field>
            <field><name>SAR_SAMPLE_HIGH</name><bitOffset>17</bitOffset><bitWidth>13</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_SAR_RESULT_2</name>
          <description>SOURCE[ROM_REV0_PHY_POWER_DETECTOR]; CONFIDENCE[instruction-exact]. Third of four consecutive dual thirteen-bit SAR result words consumed by complete phy_get_fm_sar_dout.</description>
          <addressOffset>0x0824</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>SAR_SAMPLE_LOW</name><bitOffset>1</bitOffset><bitWidth>13</bitWidth></field>
            <field><name>SAR_SAMPLE_HIGH</name><bitOffset>17</bitOffset><bitWidth>13</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>POWER_DETECTOR_SAR_RESULT_3</name>
          <description>SOURCE[ROM_REV0_PHY_POWER_DETECTOR]; CONFIDENCE[instruction-exact]. Fourth of four consecutive dual thirteen-bit SAR result words consumed by complete phy_get_fm_sar_dout.</description>
          <addressOffset>0x0828</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>SAR_SAMPLE_LOW</name><bitOffset>1</bitOffset><bitWidth>13</bitWidth></field>
            <field><name>SAR_SAMPLE_HIGH</name><bitOffset>17</bitOffset><bitWidth>13</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>TX_PA_CONTROL_0</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact]. Shared front-end low byte and PA-on high byte.</description>
          <addressOffset>0x086c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>FRONT_END_LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>PA_ON_HIGH_UNKNOWN</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>TX_PA_CONTROL_1</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,BLOB_LIBBTBB_BLE_TX_CONFIG_CHECK]; CONFIDENCE[instruction-exact]. Complete phy_tx_paon_set publishes 0x0a0e in the high half and 0xc8 in byte one. Complete ble_tx_config_check independently names the low two bytes as Bluetooth RF/PA turn-on delays.</description>
          <addressOffset>0x0870</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>RF_ON_BT_DELAY_CODE</name><description>SOURCE[BLOB_LIBBTBB_BLE_TX_CONFIG_CHECK]; CONFIDENCE[instruction-exact]. Eight-bit RF-on delay code printed by the vendor checker after integer division by 80. The electrical time unit of the raw code is not otherwise assumed.</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>PA_ON_BT_DELAY</name><description>SOURCE[BLOB_LIBBTBB_BLE_TX_CONFIG_CHECK]; CONFIDENCE[instruction-exact]. Bluetooth PA-on delay.</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>PA_ON_HIGH_UNKNOWN</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>DAC_SCALE_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_START_STOP_TX_TONE,ROM_REV0_PHY_DAC_SCALE_SET]; CONFIDENCE[instruction-exact]. Complete ROM tone start clears both byte-wide DAC-scale fields before measurement; complete phy_stop_tx_tone(1) restores both fields to 0xff through separate fresh-read writes.</description>
          <addressOffset>0x0c04</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>DAC_SCALE_LOW_UNKNOWN</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>DAC_SCALE_HIGH_UNKNOWN</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>FRONT_END_INIT_0C08</name>
          <description>SOURCE[ROM_REV0_PHY_FE_REG_INIT,BLOB_LIBPHY_PHY_FE_REG_UPDATE]; CONFIDENCE[instruction-exact]. Both complete source bodies set bit 25 and then bit 26 through separate fresh-read RMW edges.</description>
          <addressOffset>0x0c08</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>INIT_FIRST_UNKNOWN</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>INIT_SECOND_UNKNOWN</name><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
