ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>PHY_IQ_ESTIMATOR_ORACLE</name>
      <description>
        SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR,BLOB_LIBPHY_PHY_CHECK_RX_SAT];
        CONFIDENCE[instruction-exact-partial].
        DC/IQ estimator configuration, signed result and activity registers
        recovered from complete S31 rev0 ROM bodies and the complete pinned
        phy_check_rx_sat blob leaf. Unknown electrical roles remain explicit.
      </description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>ESTIMATOR_CONFIG</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_iq_est_enable replaces bits 27:26 with encoding one before each measurement.</description>
          <addressOffset>0x044c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_MODE_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact-semantics-unknown]. Two-bit field set to encoding one by phy_iq_est_enable.</description>
              <bitOffset>26</bitOffset><bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ESTIMATOR_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact-partial]. Complete phy_iq_est_enable publishes the caller control word and starts both measurement phases; complete phy_iq_est_disable clears them in reverse order around a one-microsecond delay.</description>
          <addressOffset>0x0450</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>START_ENABLE</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MEASUREMENT_ENABLE</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field>
              <name>CONTROL_WINDOW_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact-semantics-unknown]. Fifteen-bit caller value shifted left by two.</description>
              <bitOffset>2</bitOffset><bitWidth>15</bitWidth>
            </field>
            <field>
              <name>MODE_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_iq_est_enable replaces the field with encoding two.</description>
              <bitOffset>19</bitOffset><bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGNAL_POWER_SUM_I</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Signed result consumed by complete phy_rxiq_get_mis and phy_get_rx_sig_pwr.</description>
          <addressOffset>0x0454</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>SIGNAL_POWER_DIFFERENCE_I</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Signed result consumed by complete phy_rxiq_get_mis and phy_get_rx_sig_pwr.</description>
          <addressOffset>0x0458</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>SIGNAL_POWER_DIFFERENCE_Q</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Signed result consumed by complete phy_rxiq_get_mis and phy_get_rx_sig_pwr.</description>
          <addressOffset>0x045c</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>SIGNAL_POWER_SUM_Q</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Signed result consumed by complete phy_rxiq_get_mis and phy_get_rx_sig_pwr.</description>
          <addressOffset>0x0460</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>DC_I_ACCUMULATOR</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. First signed accumulator read by complete phy_dc_iq_est.</description>
          <addressOffset>0x0464</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>DC_Q_ACCUMULATOR</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Second signed accumulator read by complete phy_dc_iq_est.</description>
          <addressOffset>0x0468</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>POWER_ACCUMULATOR</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Signed power accumulator consumed by complete phy_dc_iq_est, phy_rxiq_get_mis and phy_set_rx_gain_cal_iq.</description>
          <addressOffset>0x046c</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>ESTIMATOR_READY_STATUS</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Complete phy_iq_est_enable tests bit 16 before leaving its readiness loop.</description>
          <addressOffset>0x047c</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>READY</name><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>ESTIMATOR_ACTIVITY_STATUS</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR,BLOB_LIBPHY_PHY_CHECK_RX_SAT]; CONFIDENCE[instruction-exact-partial]. Complete phy_iq_est_enable counts nonzero bits 21:20 while waiting; complete phy_check_rx_sat samples the same field exactly 100 times.</description>
          <addressOffset>0x08d0</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field>
              <name>ACTIVITY_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR,BLOB_LIBPHY_PHY_CHECK_RX_SAT]; CONFIDENCE[instruction-exact-semantics-unknown]. Nonzero is treated as IQ-estimator activity and as an RX-saturation sample.</description>
              <bitOffset>20</bitOffset><bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
