ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_STA_BEACON_FILTER</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. Station beacon-filter control word recovered from the complete enable and disable leaves. The three low bits are toggled together; individual hardware meanings remain unknown.</description>
      <baseAddress>0x201042b4</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. hal_enable_sta_beacon_filter sets bits 2:0 after enabling the matching interrupt; hal_disable_sta_beacon_filter clears them before disabling that interrupt.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>ENABLES_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_BEACON_IE_CRC</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. Full beacon-IE CRC/result word returned through the caller output pointer by complete hal_beacon_ie_crc_get.</description>
      <baseAddress>0x20104300</baseAddress>
      <registers>
        <register>
          <name>RESULT</name>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_END_STATE</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. Receive-end state word returned by the complete hal_mac_rx_get_end_state and hal_mac_rx_get_end_info leaves.</description>
      <baseAddress>0x201040a8</baseAddress>
      <registers>
        <register>
          <name>STATE</name>
          <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. hal_mac_rx_get_end_info returns the low byte through its third output pointer; hal_mac_rx_get_end_state returns the high halfword. The middle byte remains unnamed.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>LOW_STATE</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>HIGH_STATE</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RX_RUNTIME_RESULTS</name>
      <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. Sparse receive statistics-clear and end-result words recovered from complete hal_sniffer_rx_clr_statistics and hal_mac_rx_get_end_info leaves.</description>
      <baseAddress>0x20104e28</baseAddress>
      <registers>
        <register>
          <name>STATISTICS_CLEAR</name>
          <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_sniffer_rx_clr_statistics pulses bit 31 high then low using a fresh read before each write.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>CLEAR_PULSE</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>END_RESULT_LOW</name>
          <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. First full result word returned by hal_mac_rx_get_end_info.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>END_RESULT_HIGH</name>
          <description>SOURCE[BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES]; CONFIDENCE[instruction-exact-semantics-unknown]. Second full result word returned by hal_mac_rx_get_end_info.</description>
          <addressOffset>0x0c</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_BSSID_POLICY</name>
      <description>SOURCE[BLOB_LIBPP_HAL_MAC_SET_BSSID,BLOB_LIBPP_RX_POLICY,BLOB_LIBNET80211_WIFI_RX_POLICY]; CONFIDENCE[instruction-exact-hil-qualified]. Per-interface BSSID address and policy words used by scan and associated-STA receive filtering.</description>
      <baseAddress>0x20104000</baseAddress>
      <registers>
        <register><dim>4</dim><dimIncrement>0x8</dimIncrement><dimIndex>0-3</dimIndex>
          <name>BSSID_LOW%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_SET_BSSID]; CONFIDENCE[instruction-exact]. BSSID bytes 0..3 for interfaces 0..3; hal_mac_set_bssid publishes a complete full-word store.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>BYTES_0_3</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register><dim>4</dim><dimIncrement>0x8</dimIncrement><dimIndex>0-3</dimIndex>
          <name>BSSID_HIGH%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_SET_BSSID,BLOB_LIBPP_RX_POLICY,BLOB_LIBPP_HAL_RX_MISC_DEBUG,BLOB_LIBPP_HAL_HE_SET_MMSS_AND_AID,MIGRATION_HE20_ASSOCIATION]; CONFIDENCE[instruction-exact]. Canonical high BSSID, association identity and interface policy word for interfaces 0..3. Complete dbg_read_rx_misc independently decodes every field; the HE association leaf updates the MMSS/AID fields of interface zero rather than defining a second register identity.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>BSSID_HIGH</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>ASSOCIATION_ID</name><description>SOURCE[BLOB_LIBPP_HAL_RX_MISC_DEBUG]; CONFIDENCE[instruction-exact]. Eleven-bit AID printed by dbg_read_rx_misc.</description><bitOffset>16</bitOffset><bitWidth>11</bitWidth></field>
            <field><name>MINIMUM_MPDU_START_SPACING</name><description>SOURCE[BLOB_LIBPP_HAL_RX_MISC_DEBUG]; CONFIDENCE[instruction-exact]. Three-bit MMSS value printed by dbg_read_rx_misc.</description><bitOffset>27</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>INTERFACE_IS_SOFT_AP</name><description>SOURCE[BLOB_LIBPP_HAL_RX_MISC_DEBUG,BLOB_LIBPP_RX_POLICY]; CONFIDENCE[instruction-exact]. Cleared for interface zero by the associated-STA policy-five transaction.</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ADDRESS_CHECK_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_SET_BSSID,BLOB_LIBPP_RX_POLICY,BLOB_LIBNET80211_WIFI_RX_POLICY,BLOB_LIBPP_HAL_RX_MISC_DEBUG]; CONFIDENCE[instruction-exact-partial]. MACBSSID_EN: hal_mac_set_bssid clears this bit before changing the address and sets it after publication; the reachable associated-STA policy branch also sets it.</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
