ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_CONTROL</name>
      <description>SOURCE[OPEN_DRIVER_PROMISCUOUS_RX_FRONTIER,BLOB_LIBPP_MAC_CHANNEL_SWITCH]; CONFIDENCE[instruction-exact-hil-qualified]. Shared MAC run/stop control. The cold open-RX frontier publishes zero; the complete vendor channel-switch chain requests quiescence here and later restarts the no-power-save profile.</description>
      <baseAddress>0x20104cac</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[OPEN_DRIVER_PROMISCUOUS_RX_FRONTIER,BLOB_LIBPP_MAC_CHANNEL_SWITCH]; CONFIDENCE[instruction-exact-hil-qualified]. Cold promiscuous initialization writes zero. hal_mac_deinit records bits 13 and 14 as TX/RX activity and sets bit 12 plus bits 23:16; hal_mac_init with WIFI_PS_NONE clears that same stop-request mask.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>LOW_CONTROL_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field>
            <field><name>NO_RETENTION_STOP_REQUEST</name><description>SOURCE[BLOB_LIBPP_MAC_CHANNEL_SWITCH]; CONFIDENCE[instruction-exact]. Included in the MAC stop request and cleared by hal_mac_init for the WIFI_PS_NONE all-ones retention mask.</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ACTIVE_STATE</name><description>SOURCE[BLOB_LIBPP_MAC_CHANNEL_SWITCH,MIGRATION_CHANNEL_SWITCH]; CONFIDENCE[instruction-exact-partial]. Three-bit activity state polled until zero before PHY retuning. hal_mac_deinit independently records bit 13 as TX active and bit 14 as RX active; bit 15 remains unnamed.</description><bitOffset>13</bitOffset><bitWidth>3</bitWidth><access>read-only</access></field>
            <field><name>TX_BLOCK_STOP_REQUEST</name><description>SOURCE[BLOB_LIBPP_MAC_CHANNEL_SWITCH]; CONFIDENCE[instruction-exact]. Eight stop-request bits selected from the WIFI_PS_NONE TX-block retention mask by hal_mac_deinit and cleared by hal_mac_init.</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>HIGH_CONTROL_UNKNOWN</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_REGDMA_CONTROL</name>
      <description>SOURCE[BLOB_LIBPP_MAC_CHANNEL_SWITCH,HIL_OPEN_REGDMA_LINK4_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Wi-Fi MAC REGDMA link selection updated by the complete ic_mac_init tail after every vendor channel change. Exact pre-auth vendor state and connected open HIL require link four.</description>
      <baseAddress>0x2010d83c</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_MAC_CHANNEL_SWITCH,HIL_OPEN_REGDMA_LINK4_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. pwr_hal_select_wifimac_regdma_link replaces bits 20:17; ic_mac_init and the working open no-power-save restart select link four.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>LOW_CONTROL_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>17</bitWidth></field>
            <field><name>ACTIVE_LINK</name><description>SOURCE[BLOB_LIBPP_MAC_CHANNEL_SWITCH,HIL_OPEN_REGDMA_LINK4_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Four-bit Wi-Fi MAC REGDMA link selector; the active no-power-save channel restart writes four. Leaving zero after retuning caused intermittent authentication ACK timeouts.</description><bitOffset>17</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>HIGH_CONTROL_UNKNOWN</name><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_CRYPTO_CONTROL</name>
      <description>
        SOURCE[BLOB_LIBPP_HAL_CRYPTO,BLOB_LIBPP_HAL_CRYPTO_INIT];
        CONFIDENCE[instruction-exact-hil-qualified].
        Per-interface hardware-crypto controls, shared policy mask and key
        validity bitmap recovered from complete libpp hal_crypto leaves.
      </description>
      <baseAddress>0x20104800</baseAddress>
      <registers>
        <register>
          <dim>3</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-2</dimIndex>
          <name>INTERFACE_CONTROL%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_CRYPTO]; CONFIDENCE[instruction-exact-partial]. STA, AP and NAN interface controls selected by hal_crypto_enable. The open STA CCMP path writes the complete image 0x00030103, then clears bits 31:30.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>CONTROL_LOW_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_CRYPTO]; CONFIDENCE[instruction-exact-semantics-unknown]. Algorithm, enable and management-frame policy fields composed by the complete leaf; individual electrical meanings remain partly unknown.</description><bitOffset>0</bitOffset><bitWidth>30</bitWidth></field>
            <field><name>MODE_HIGH_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_CRYPTO]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete ordinary enable clears both high bits; one algorithm branch sets bit 31.</description><bitOffset>30</bitOffset><bitWidth>2</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>POLICY_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_CRYPTO]; CONFIDENCE[instruction-exact-partial]. Shared policy word. The ordinary non-algorithm-four enable path preserves bits 31:22 and 5:0 while clearing bits 21:6.</description>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>LOW_POLICY_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>ORDINARY_ENABLE_CLEAR_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_CRYPTO]; CONFIDENCE[instruction-exact-semantics-unknown]. Cleared by the reachable STA CCMP enable transaction.</description><bitOffset>6</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>HIGH_POLICY_UNKNOWN</name><bitOffset>22</bitOffset><bitWidth>10</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>INIT_AUX_UNKNOWN</name>
          <description>SOURCE[BLOB_LIBPP_HAL_CRYPTO_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. Fourth full-word cold-init store, cleared by complete hal_crypto_init. Its algorithm-specific meaning is not yet recovered.</description>
          <addressOffset>0x0c</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>VALUE_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>KEY_VALID_BITMAP</name>
          <description>SOURCE[BLOB_LIBPP_HAL_CRYPTO]; CONFIDENCE[instruction-exact]. One validity bit per one of the 25 evidenced hardware key entries.</description>
          <addressOffset>0x14</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>VALID_ENTRIES</name><description>SOURCE[BLOB_LIBPP_HAL_CRYPTO]; CONFIDENCE[instruction-exact]. Bits 24:0 correspond to key-table entries 24:0.</description><bitOffset>0</bitOffset><bitWidth>25</bitWidth></field>
          </fields>
        </register>
