ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex>
          <name>HE_SU_SIGNAL_A2_LENGTH%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_HE_TX,BLOB_LIBPP_PP_HE_AMPDU_LENGTH,BLOB_LIBPP_PP_HE_SMPDU_LENGTH,HIL_VENDOR_HE20_MCS9_SU_2026_07_29,HIL_VENDOR_HE20_MCS0_DCM_RAW_2026_07_29,HIL_VENDOR_HE_CONTROL_INSERTION_2026_07_30,HIL_OPEN_HE_CONTROL_METADATA_2026_07_30,HIL_OPEN_HE20_MCS0_DCM_SMPDU_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Complete mac_tx_set_hesig writes this second HE SU vector word at 0x201054f8-q*0x7c. It combines a bounded low control image with the complete HE APEP byte length shifted by eleven and a frame-class bit copied to bit 28. A-MPDU length 0x76 produced 0x1003b105; the live vendor throughput path independently reported length 0x061a in 0x1030d105. Complete ppCalSubFrameLength adds four to APEP when DMA metadata byte seven bit zero selects hardware HE-Control insertion, while leaving the low fourteen-bit MPDU length and DMA CCMP position unchanged. The vendor and open 24-byte raw S-MPDU paths both use APEP length 32, producing 0x00010105 with bit 28 clear.</description>
          <addressOffset>0x20</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>CONTROL_LOW</name><description>SOURCE[BLOB_LIBPP_HAL_HE_TX,HIL_VENDOR_HE20_MCS9_SU_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Ten-bit HE-SIG-A2/control image derived from coding, STBC and related descriptor state. The bounded BCC, non-STBC, non-beamformed SU oracle uses 0x105.</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            <field><name>DESCRIPTOR_CLASS_MATCH</name><description>SOURCE[BLOB_LIBPP_HAL_HE_TX]; CONFIDENCE[instruction-exact-semantics-unknown]. Set exactly when descriptor byte 0x2f bits 6:3 equal seven.</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>APEP_LENGTH</name><description>SOURCE[BLOB_LIBPP_PP_HE_AMPDU_LENGTH,BLOB_LIBPP_PP_HE_SMPDU_LENGTH,BLOB_LIBPP_HAL_HE_TX,HIL_VENDOR_HE20_MCS9_SU_2026_07_29,HIL_VENDOR_HE20_MCS0_DCM_RAW_2026_07_29,HIL_VENDOR_HE_CONTROL_INSERTION_2026_07_30,HIL_OPEN_HE_CONTROL_METADATA_2026_07_30,HIL_OPEN_HE20_MCS0_DCM_SMPDU_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Sixteen-bit assembled HE APEP byte count produced by ppCalTxHEAMPDULength or ppCalTxHESMPDULength and copied by mac_tx_set_hesig. For A-MPDU, DMA metadata byte seven bit zero contributes the four-byte hardware HE-Control insertion without changing the low fourteen-bit MPDU length. The qualified S-MPDU value is 32 bytes: four-byte delimiter plus 24-byte MPDU, four-byte hardware FCS slot and alignment.</description><bitOffset>11</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>AMPDU_LENGTH_VALID</name><description>SOURCE[BLOB_LIBPP_HAL_HE_TX,HIL_VENDOR_HE20_MCS9_SU_2026_07_29,HIL_VENDOR_HE20_MCS0_DCM_RAW_2026_07_29,HIL_OPEN_HE20_MCS0_DCM_SMPDU_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Copy of frame-state bit 12; set in live HE A-MPDU images and clear in the acknowledged HE S-MPDU image.</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex>
          <name>HE_MPDU_LENGTH_TAIL%s</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TX_SET_TB,ROM_REV0_MAC_TX_SET_TB]; CONFIDENCE[instruction-exact]. Complete mac_tx_set_mplen writes the final allocated seven-bit HE MPDU-length link index at 0x201054fc-q*0x7c when it reaches the DMA descriptor whose word zero bit 30 marks the tail. Bits 31:7 are preserved. Complete mac_tx_set_tb calls that leaf for every frame before making the queue Trigger-eligible.</description>
          <addressOffset>0x24</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>LINK_INDEX</name><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field></fields>
        </register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex><name>POWER%s</name><description>SOURCE[BLOB_LIBPP_HAL_MAC_TX]; CONFIDENCE[instruction-exact-partial]. Packed data/RTS PHY gain-table indices, not dBm.</description><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex>
          <name>HT_DESCRIPTOR_COUNTS%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_TX,HIL_VENDOR_CONNECTED_VECTOR_2026_07_29,HIL_OPEN_HT_AMPDU_DIRECT_2026_07_29,HIL_OPEN_HT_AMPDU_32_RETRY_2026_07_29]; CONFIDENCE[instruction-exact-hil-qualified]. Complete libpp.a[hal_mac_tx.o]::mac_tx_set_htsig constructs the base address 0x20105504-q*0x7c, then copies descriptor byte 0x2a into bits 6:0 and 20:14 and descriptor byte 0x2e into bits 13:7 through three fresh-read RMW edges. The vendor oracle read 0x00004081 for idle ordinary queues, consistent with one descriptor in all three fields. Open direct-DMA HIL first qualified two in all three lanes, then qualified the full negotiated 32-frame window with a 48,448-byte A-MPDU and complete BlockAck.</description>
          <addressOffset>0x2c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>DESCRIPTOR_COUNT_A</name><description>Seven-bit descriptor byte 0x2a copied by complete mac_tx_set_htsig.</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field>
            <field><name>DESCRIPTOR_COUNT_B</name><description>Seven-bit descriptor byte 0x2e copied by complete mac_tx_set_htsig.</description><bitOffset>7</bitOffset><bitWidth>7</bitWidth></field>
            <field><name>DESCRIPTOR_COUNT_A_COPY</name><description>Second copy of descriptor byte 0x2a written by complete mac_tx_set_htsig.</description><bitOffset>14</bitOffset><bitWidth>7</bitWidth></field>
            <field><name>HIGH_UNKNOWN</name><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field>
          </fields>
        </register>
