ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_COEX_INIT</name>
      <description>SOURCE[BLOB_LIBPP_HAL_INIT_COEX,BLOB_LIBCOEX_PTI_TABLE]; CONFIDENCE[instruction-exact]. Complete COEX/PTI tail of hal_init and complete setter leaves. PTI values remain platform-supplied because the coexistence table may be changed at runtime.</description>
      <baseAddress>0x201042fc</baseAddress>
      <registers>
        <register>
          <name>RX_PTI</name>
          <description>SOURCE[BLOB_LIBPP_HAL_INIT_COEX]; CONFIDENCE[instruction-exact]. Complete hal_init replaces RX-active and RX-ACK nibbles through two separate setter RMWs.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>RX_ACTIVE</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_COEX]; CONFIDENCE[instruction-exact]. Complete hal_init passes zero to hal_set_rx_active_pti.</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>RX_ACK</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_COEX,BLOB_LIBCOEX_PTI_TABLE]; CONFIDENCE[instruction-exact]. PTI returned for event three and published by hal_set_rx_ack_pti.</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field>

          </fields>
        </register>
        <register>
          <name>OFDMA_TB_AND_BEAMFORMING</name>
          <description>SOURCE[BLOB_LIBPP_HAL_INIT_COEX,BLOB_LIBCOEX_PTI_TABLE]; CONFIDENCE[instruction-exact]. Seven trigger-based PTIs and one beamforming PTI, each published through a separate fresh-read RMW by complete setters.</description>
          <addressOffset>0xad8</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TB_4</name><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>TB_6</name><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>TB_5</name><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>TB_3</name><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>TB_2</name><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>TB_1</name><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>TB_0</name><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>BEAMFORMING_0</name><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>BEAMFORMING</name>
          <description>SOURCE[BLOB_LIBPP_HAL_INIT_COEX,BLOB_LIBCOEX_PTI_TABLE]; CONFIDENCE[instruction-exact]. Two ordinary and two multi-target beamforming PTI fields, programmed through four separate fresh-read RMWs.</description>
          <addressOffset>0xadc</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>BEAMFORMING_2</name><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>BEAMFORMING_1</name><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>MULTI_TARGET_1</name><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>MULTI_TARGET_0</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_COEX]; CONFIDENCE[instruction-exact]. Complete hal_set_beamf_mt_pti replaces bits 21:12 with its unmasked first argument; cold PTI values occupy only the low nibble of this ten-bit field.</description><bitOffset>12</bitOffset><bitWidth>10</bitWidth></field>

          </fields>
        </register>
        <register>
          <name>DEFAULT_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_INIT_COEX,BLOB_LIBCOEX_PTI_TABLE]; CONFIDENCE[instruction-exact]. Common COEX enable/default PTI word updated by three separate setter RMWs.</description>
          <addressOffset>0xae0</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>WIFI_DEFAULT_PTI</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_COEX,BLOB_LIBCOEX_PTI_TABLE]; CONFIDENCE[instruction-exact]. PTI returned for event fifteen.</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>DEFAULT_PTI_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_COEX]; CONFIDENCE[instruction-exact]. Set by hal_coex_enable_default_pti(1).</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>COEX_PTI_INIT_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_COEX]; CONFIDENCE[instruction-exact]. Set by complete hal_coex_pti_init.</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>

          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_ANTENNA_INIT</name>
      <description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_attenna_init transaction. The misspelled vendor symbol first visits eight reverse-stride queue/vector words, then updates one common word.</description>
      <baseAddress>0x201042b0</baseAddress>
      <registers>
        <register>
          <name>COMMON_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete leaf clears bit 2, then sets bit 5 through a separate fresh-read RMW.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field><name>COMMON_CLEAR_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact]. Cleared by the penultimate RMW of the complete leaf.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>COMMON_ENABLE_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact]. Set by the final RMW of the complete leaf.</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>

          </fields>
        </register>
        <register>
          <dim>4</dim><dimIncrement>0x7c</dimIncrement><dimIndex>0-3</dimIndex>
          <name>BANK_CONTROL%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. Lower four unique words of the eight-word antenna traversal, at 0x201051ac..0x20105320. The upper four words are the canonical WIFI_MAC_TX_QUEUE_VECTOR.LENGTH_CONTROL array, whose decoded antenna fields occupy the same bits.</description>
          <addressOffset>0xefc</addressOffset><size>32</size><access>read-write</access>
          <fields>

