ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
            <field><name>FIRST_CLEAR_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact]. Cleared for all eight words in the first reverse traversal.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SECOND_CLEAR_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact]. Cleared in the first RMW of each word in the second reverse traversal.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>THIRD_CLEAR_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact]. Cleared in the third RMW of each word in the second reverse traversal.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BANK_ENABLE_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_ANTENNA_INIT]; CONFIDENCE[instruction-exact]. Set in the middle RMW of each word in the second reverse traversal.</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>

          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TSF_STATUS</name>
      <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Station TSF activity status recovered from the complete no-call hal_is_sta_tsf_active leaf. The instruction body proves the address and bit geometry but not the hardware transition rules.</description>
      <baseAddress>0x2010d80c</baseAddress>
      <registers>
        <register>
          <name>STATUS</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_is_sta_tsf_active returns bit zero.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-only</access>
          <fields><field><name>STATION_ACTIVE</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_STA_TBTT_TARGET</name>
      <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Station TBTT target word recovered from complete hal_set_sta_tbtt. The low 26-bit packing from the supplied 64-bit TSF value is exact; the hardware counter unit remains unnamed.</description>
      <baseAddress>0x2010d82c</baseAddress>
      <registers>
        <register>
          <name>TARGET</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_set_sta_tbtt replaces bits 25:0 with bits 35:10 of the supplied station TSF value and preserves the high six bits.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>TSF_BITS_35_10</name><bitOffset>0</bitOffset><bitWidth>26</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_STA_TSF_LOAD</name>
      <description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. Complete hal_set_sta_tsf transaction: publish the low and high 32-bit station TSF value, then assert the station load request through a fresh-read RMW.</description>
      <baseAddress>0x2010d814</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. Complete hal_set_sta_tsf asserts bit four after writing both station TSF value words.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>LOAD_STATION_TSF</name><description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. Station TSF load request asserted by the final fresh-read RMW in hal_set_sta_tsf.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>VALUE_LOW</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. Low 32 bits written first by complete hal_set_sta_tsf.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>VALUE_HIGH</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. High 32 bits written second by complete hal_set_sta_tsf.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_RTC_TIMER_UPDATE</name>
      <description>SOURCE[BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact-partial]. Complete enabled path of hal_timer_update_by_rtc, reached from complete hal_init with enable one and the OS-adapter slow-clock calibration value.</description>
      <baseAddress>0x2010d830</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_INIT_TAIL,BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. Enabled hal_timer_update_by_rtc sets bit 27. hal_set_sta_tsf_wakeup sets or clears bit 21 together with the STA TSF wakeup bit at 0x2010d858.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field><name>STA_TSF_WAKEUP_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. hal_set_sta_tsf_wakeup sets or clears this bit in the same branch as STA_TSF_CONTROL.STA_TSF_WAKEUP_ENABLE.</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>RTC_UPDATE_ENABLE_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact]. Set when the leaf's enable argument is nonzero.</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>

          </fields>
        </register>
        <register>
          <name>SOC_WAKEUP_CLEAR</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_tsf_clear_soc_wakeup_request sets bit 30 through a fresh-read RMW. Whether the hardware treats the bit as a pulse or retained request acknowledgement is not inferred.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>CLEAR_REQUEST</name><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>STA_LIGHT_SLEEP_WAKE_AHEAD</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact]. Complete hal_set_sta_light_sleep_wake_ahead_time replaces the high sixteen bits. Complete hal_set_sta_tbtt independently publishes its fifth argument to the same field.</description>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>TIME</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field></fields>
        </register>
        <register>
          <name>RX_BEACON_TIME_LOW</name>
          <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact]. Complete hal_set_rx_beacon_time replaces the low sixteen bits from its first argument before publishing the remaining recovered byte in WIFI_MAC_COEX_RUNTIME.RX_BEACON_TIME_HIGH.</description>
          <addressOffset>0x24</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields>
        </register>
        <register>
          <name>STA_TSF_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF,BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact]. Shared STA TSF scheduler and modem-state wakeup control word used by hal_enable_sta_tsf, hal_disable_sta_tsf, hal_set_sta_tsf_wakeup, and the wakeup-protect enable/disable leaves.</description>
          <addressOffset>0x28</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field><name>STA_TSF_MODE</name><description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. hal_enable_sta_tsf replaces bits 22:19 with one; hal_disable_sta_tsf clears them.</description><bitOffset>19</bitOffset><bitWidth>4</bitWidth></field>

