ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
            <field><name>MODEM_STATE_WAKEUP_PROTECT_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_PWR]; CONFIDENCE[instruction-exact]. pwr_hal_set_mac_modem_state_wakeup_protect_enable sets this bit and the corresponding disable leaf clears it.</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>STA_TSF_ENABLE_LOW</name><description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. hal_enable_sta_tsf sets this bit and hal_disable_sta_tsf clears it.</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>STA_TSF_WAKEUP_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. hal_set_sta_tsf_wakeup sets or clears this bit together with WIFI_MAC_RTC_TIMER_UPDATE.CONTROL.STA_TSF_WAKEUP_ENABLE.</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field>

            <field><name>STA_TSF_ENABLE_HIGH</name><description>SOURCE[BLOB_LIBPP_HAL_TSF]; CONFIDENCE[instruction-exact]. hal_enable_sta_tsf sets this bit and hal_disable_sta_tsf clears it.</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>STA_TBTT_INTERVAL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_set_sta_tbtt_interval replaces the low 22 bits from argument bits 31:10. Complete hal_set_sta_tbtt performs the same update from its third argument.</description>
          <addressOffset>0x2c</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>INTERVAL_BITS_31_10</name><bitOffset>0</bitOffset><bitWidth>22</bitWidth></field></fields>
        </register>
        <register>
          <name>SLOW_CLOCK_CALIBRATION</name>
          <description>SOURCE[BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact]. Enabled hal_timer_update_by_rtc replaces bits 17:0 with the low eighteen bits returned by g_wifi_osi_funcs._slowclk_cal_get.</description>
          <addressOffset>0x48</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>VALUE</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact]. Low eighteen bits of the OS-adapter calibration value.</description><bitOffset>0</bitOffset><bitWidth>18</bitWidth></field>

          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_AUX_TSF_CONTROL</name>
      <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. SoftAP, NAN and broadcast-TWT TSF control words. Complete public leaves prove their addresses and exact enable/mode masks; unrelated bits and hardware transition rules remain unnamed.</description>
      <baseAddress>0x2010d860</baseAddress>
      <registers>
        <register>
          <name>SOFTAP_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_disable_softap_tsf clears bits 31:30. Generic TSF enable/disable leaves independently identify bit 31 as the domain enable; bit 30 remains unknown.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>HIGH_CONTROL_UNKNOWN</name><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TSF_ENABLE</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>NAN_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete NAN enable/disable leaves use the same two-stage gate and mode transaction as station TSF at this distinct word.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TSF_MODE</name><bitOffset>19</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>TSF_ENABLE_LOW</name><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TSF_ENABLE_HIGH</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>BTWT_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_enable_sta_btwt_tsf enables or disables the broadcast-TWT TSF domain using the same gate and mode masks as station TSF.</description>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TSF_MODE</name><bitOffset>19</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>TSF_ENABLE_LOW</name><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TSF_ENABLE_HIGH</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TXRX_PREFIX</name>
      <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_PREFIX,BLOB_LIBPP_HAL_INIT_TAIL]; CONFIDENCE[instruction-exact-partial]. Eighteen direct fresh-read RMW edges before the first external HE callback in complete mac_txrx_init; complete hal_init later repeats the bit-28 set edge.</description>
      <baseAddress>0x201040fc</baseAddress>
      <registers>
        <register><dim>4</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-3</dimIndex>
          <name>RX_QUEUE_DEFAULT%s</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_PREFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Four queue words have their high half cleared independently; queue zero and one then receive separate bit-24 and bit-26 set edges.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>

            <field><name>HIGH_23_16_UNKNOWN</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>QUEUE_BIT_24_UNKNOWN</name><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>QUEUE_BIT_25_UNKNOWN</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>QUEUE_BIT_26_UNKNOWN</name><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>HIGH_31_27_UNKNOWN</name><bitOffset>27</bitOffset><bitWidth>5</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>CONTROL_EDGES</name>
          <description>SOURCE[BLOB_LIBPP_MAC_TXRX_INIT_PREFIX]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete prefix sets bit 0, then bit 4 through a second fresh-read RMW.</description>
          <addressOffset>0x18</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>FIRST_ENABLE_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>

