ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_TSF_TIMER</name>
      <description>SOURCE[BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. Four-entry TSF timer bank recovered from all complete target, wakeup and enable/disable leaves. Each entry consists of one control word followed by its 32-bit target. The public index is guarded to zero through three by the target and timer-enable leaves; the dedicated wakeup leaves do not contain their own range check.</description>
      <baseAddress>0x2010d87c</baseAddress>
      <registers>
        <register><dim>4</dim><dimIncrement>0x08</dimIncrement><dimIndex>0-3</dimIndex>
          <name>CONTROL%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact-semantics-unknown]. Per-timer control word at 0x2010d87c + index*8. Complete target accessors replace and return the low three bits; the exact semantics of that field remain unknown. Dedicated leaves set or clear wakeup bit 30, while the timer enable/disable leaves set or clear bit 31.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>LOW_CONTROL_UNKNOWN</name><description>SOURCE[BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_tsf_timer_set_target replaces these bits from its third argument and hal_tsf_timer_get_target returns them through its second output pointer.</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>WAKEUP_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. Set by hal_enable_tsf_timer_wakeup and cleared by hal_disable_tsf_timer_wakeup.</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIMER_ENABLE</name><description>SOURCE[BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. Set by hal_enable_tsf_timer and cleared by hal_disable_tsf_timer.</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register><dim>4</dim><dimIncrement>0x08</dimIncrement><dimIndex>0-3</dimIndex>
          <name>TARGET%s</name>
          <description>SOURCE[BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. Full 32-bit timer target written by hal_tsf_timer_set_target and returned through the first output pointer by hal_tsf_timer_get_target.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_COEX_RUNTIME</name>
      <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Runtime receive-beacon and individual-TWT COEX/PTI words recovered from five complete hal_coex.o leaves. Register addresses, masks and RMW order are exact; fields whose electrical meaning is not established retain UNKNOWN names.</description>
      <baseAddress>0x2010d89c</baseAddress>
      <registers>
        <register>
          <name>CLEAR_REQUEST</name>
          <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_clear_rx_beacon_pti sets bit zero through a fresh-read RMW. Complete hal_clr_itwt_pti sets the input-selected bit through the same word; the accepted index domain and remaining bit identities are not inferred.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>REQUESTS_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields>
        </register>
        <register>
          <name>RX_BEACON_TIME_HIGH</name>
          <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact]. Complete hal_set_rx_beacon_time replaces the low byte from bits 15:8 of its second argument after updating WIFI_MAC_RTC_TIMER_UPDATE.RX_BEACON_TIME_LOW.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>VALUE</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields>
        </register>
        <register>
          <name>ITWT_CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete hal_set_itwt_pti clears the low byte and then writes seqz(argument zero) into bit zero. The remaining low-byte semantics are unknown.</description>
          <addressOffset>0x08</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>LOW_CONTROL_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields>
        </register>
        <register>
          <name>SHARED_RX_PTI</name>
          <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact-semantics-unknown]. Shared low-nibble PTI word updated from the second argument by complete hal_set_rx_beacon_pti and hal_set_itwt_pti.</description>
          <addressOffset>0x0c</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>PTI</name><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
        <register>
          <name>RX_BEACON_PTI</name>
          <description>SOURCE[BLOB_LIBPP_HAL_COEX_RUNTIME]; CONFIDENCE[instruction-exact]. Complete hal_set_rx_beacon_pti replaces bits 15:12 from the low nibble of its first argument.</description>
          <addressOffset>0x10</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>PTI</name><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field></fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_POWER_INTERRUPT</name>
      <description>SOURCE[BLOB_LIBPP_ISR_REGISTER_DUMP,BLOB_LIBPP_HAL_PWR_INTERRUPT,BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. WDEVPWR interrupt bank named by complete print_isr_regs. Complete hal_pwr_interrupt_get_event and hal_pwr_interrupt_clr_event independently prove the masked STATUS read and full-width CLEAR acknowledgement transaction. Complete TSF timer enable/disable leaves update the timer interrupt masks in ENABLE and clear stale events through CLEAR.</description>
      <baseAddress>0x2010d8b4</baseAddress>
      <registers>
        <register><name>ENABLE</name><description>SOURCE[BLOB_LIBPP_ISR_REGISTER_DUMP,BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. WDEVPWR_ENABLE diagnostic snapshot and writable event mask. hal_enable_tsf_timer sets bit 7-index and hal_disable_tsf_timer clears the same bit for guarded timer indices zero through three.</description><addressOffset>0x00</addressOffset><size>32</size><access>read-write</access><fields><field><name>EVENT_MASK</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>RAW</name><description>WDEVPWR_RAW diagnostic snapshot.</description><addressOffset>0x04</addressOffset><size>32</size><access>read-only</access><fields><field><name>EVENTS</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>STATUS</name><description>SOURCE[BLOB_LIBPP_ISR_REGISTER_DUMP,BLOB_LIBPP_HAL_PWR_INTERRUPT]; CONFIDENCE[instruction-exact]. Masked WDEVPWR event image returned by complete hal_pwr_interrupt_get_event.</description><addressOffset>0x08</addressOffset><size>32</size><access>read-only</access><fields><field><name>EVENTS</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
        <register><name>CLEAR</name><description>SOURCE[BLOB_LIBPP_HAL_PWR_INTERRUPT,BLOB_LIBPP_HAL_TSF_TIMER]; CONFIDENCE[instruction-exact]. Full event image stored by complete hal_pwr_interrupt_clr_event to acknowledge WDEVPWR events. hal_enable_tsf_timer performs a fresh-read RMW which asserts bit 7-index here before enabling the selected timer.</description><addressOffset>0x0c</addressOffset><size>32</size><access>read-write</access><modifiedWriteValues>oneToClear</modifiedWriteValues><fields><field><name>EVENTS</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WIFI_MAC_COLD_HANDSHAKE</name>
      <description>SOURCE[BLOB_LIBPP_HAL_INIT_PREFIX]; CONFIDENCE[instruction-exact]. Cold MAC initialization request/ready handshake at the complete hal_init prefix.</description>
      <baseAddress>0x20104de0</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPP_HAL_INIT_PREFIX]; CONFIDENCE[instruction-exact]. Software sets REQUEST with a fresh-read RMW, then polls READY before touching the remaining MAC state.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>READY</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_PREFIX]; CONFIDENCE[instruction-exact]. Polled until asserted after REQUEST.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field>
            <field><name>REQUEST</name><description>SOURCE[BLOB_LIBPP_HAL_INIT_PREFIX]; CONFIDENCE[instruction-exact]. Set before the READY polling loop.</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>UNKNOWN</name><bitOffset>2</bitOffset><bitWidth>30</bitWidth></field>
          </fields>
        </register>
