ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_BITMAP_LOW</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK]; CONFIDENCE[instruction-exact]. Shared extra-SoftAP low receive/reorder bitmap staging word, cleared when installing or removing an entry.</description>
          <addressOffset>0x0eb4</addressOffset><size>32</size><access>read-write</access>
        </register>
        <register>
          <name>EXTRA_SOFTAP_RX_BLOCK_ACK_BITMAP_HIGH</name>
          <description>SOURCE[BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK]; CONFIDENCE[instruction-exact]. Shared extra-SoftAP high receive/reorder bitmap staging word, cleared when installing or removing an entry.</description>
          <addressOffset>0x0eb8</addressOffset><size>32</size><access>read-write</access>
        </register>
      </registers>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <openEspRadioProvenance>
      <source id="S31_MODEM_SYSCON_STRUCT">esp-wifi-sys commit 2585f278d381acc67c529fa730b91739b5461359, c/include/esp32s31/modem/modem_syscon_struct.h, sha256 1d37b7f4748e9b665ed1bf4f25dc85cd20d25fa5ab2726db82766dd0b506f69e</source>
      <source id="S31_MODEM_LPCON_STRUCT">esp-wifi-sys commit 2585f278d381acc67c529fa730b91739b5461359, c/include/esp32s31/modem/modem_lpcon_struct.h, sha256 af916837fb4c4ed8092fba78a844cc656299acfd63764a420c4c4fdac3472453</source>
      <source id="S31_ESP_PACS_SVD">local esp-pacs commit f823dd9de91c0b83c5e8e85cbea4749dbabc4a27, esp32s31/svd/esp32s31.svd</source>
      <source id="S31_REG_BASE">esp-wifi-sys commit 72b97e6fe55307aa92c8c1edf3fdb3f4df816e80, c/include/esp32s31/soc/reg_base.h, sha256 24a0c98ca63b042ed32d42c5566b979d412e04ec7b1b9d305bb7addc12577f9d; names the HP-system 0x205x, LP-system 0x207x and LP-peripheral 0x208x blocks and IEEE802154_REG_BASE in the 0x201x modem/radio window</source>
      <source id="BLOB_LIBPHY_PHY_START_TX_TONE_STEP_NEW">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_reg.o phy_start_tx_tone_step_new body, size 0xc2.</source>
      <source id="BLOB_LIBPHY_PHY_XTAL_DUTY_CAL">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_rx_cal.o phy_xtal_duty_cal body, size 0x392.</source>
      <source id="BLOB_LIBPHY_PHY_DEBUG_REG_CHECK">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_debug.o phy_reg_check body, size 0x3d2. Its fixed loop bounds and block-name strings prove the half-open hardware dump ranges recorded in openEspRadioEvidenceRanges; they do not name individual registers.</source>
      <source id="BLOB_LIBPHY_PHY_DEBUG_I2C">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_debug.o phy_i2c_check body, size 0x1f6. Its ten calls prove each logical bank name, block ID, selected host and half-open register-index range.</source>
      <source id="BLOB_LIBPHY_PHY_DEBUG_PBUS">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_debug.o phy_pbus_print body, size 0xf4. Its finite calls and strings associate selector/path pairs with RFRX, RFTX, BB and DCO groups.</source>
      <source id="BLOB_LIBBTBB_BLE_TX_CONFIG_CHECK">_oracles/libbtbb.a sha256 ebd67c6a32081d0fcd143bbb0ed53f962fc587058e20eceb59012beae47528df; complete bt_bb_v2.o ble_tx_config_check body, size 0x1c0. Its loads, masks and pinned field-name strings prove the BLE TX timing fields, including RF_ON_BT_DELAY and PA_ON_BT_DELAY in the canonical FECTRL word at 0x20100870.</source>
      <source id="BLOB_LIBBTBB_BT_CTE_ACCESSORS">_oracles/libbtbb.a sha256 ebd67c6a32081d0fcd143bbb0ed53f962fc587058e20eceb59012beae47528df; bt_cte.o public getter/setter pairs. Matching independent masks provide instruction-exact CTE and BTAGC field geometry; these BT-only registers remain evidence for a separate canonical BT-radio SVD rather than duplicate singleton peripherals in this Wi-Fi-oriented map.</source>
      <source id="BLOB_LIBPP_ISR_REGISTER_DUMP">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o print_isr_regs body, size 0x5a, and pinned register-name strings. It reads WDEV ENABLE/RAW/STATUS at 0x20104c40/44/48, WDEV_INT1 ENABLE/RAW/STATUS at 0x20104c2c/30/34 and WDEVPWR ENABLE/RAW/STATUS at 0x2010d8b4/b8/bc.</source>
      <source id="BLOB_LIBPP_TEST_HAL_CSI">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete test_hal.o esp_test_get_csi_dump_cfg body, size 0x8a, and esp_test_set_csi_dump_cfg body, size 0x22e. The getter independently proves every promoted field. The setter contains a reproducible vendor quirk: cfg[8] gates the BEAMFORMED update, but retained cfg[1] supplies bit 11.</source>
      <source id="BLOB_LIBPP_PP_DEBUG_DIAGNOSTIC_STATISTICS">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete pp_debug.o dbg_lmac_diag_statis_dump body, size 0x17c, and its pinned diag0..diag12/diagsel format strings.</source>
      <source id="BLOB_LIBPP_PP_DEBUG_HW_STATISTICS">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete pp_debug.o dbg_lmac_hw_statis_dump body, size 0x252, and its pinned hardware-counter format strings.</source>
      <source id="BLOB_LIBPP_HAL_MAC_INTERRUPT_GET_EVENT">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o hal_mac_interrupt_get_event body, size 0x0a.</source>
      <source id="BLOB_LIBPP_HAL_MAC_INTERRUPT_CLR_EVENT">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o hal_mac_interrupt_clr_event body, size 0x0a; writes the supplied event bitmap to the clear register.</source>
      <source id="BLOB_LIBPP_HAL_MAC_INTERRUPT_CLR_WATCHDOG">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o hal_mac_interrupt_clr_watchdog body, size 0x16.</source>
      <source id="BLOB_LIBPP_HAL_PWR_INTERRUPT">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_pwr.o hal_pwr_interrupt_get_event body, size 0x0a, reads 0x2010d8bc; complete hal_pwr_interrupt_clr_event body, size 0x0a, stores its full event argument to 0x2010d8c0.</source>
      <source id="BLOB_LIBPP_WDEV_PROCESS_FIQ">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete wdev.o wDev_ProcessFiq body, size 0x1ae, including MAC event-mask dispatch and event-clear call graph.</source>
      <source id="BLOB_LIBPP_HAL_MAC_COLOR_COLLISION_ISR">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete color-collision branch reached from wdev.o wDev_ProcessFiq and the independently named dbg_read_color_collision register decode.</source>
      <source id="BLOB_LIBPP_HAL_TSF">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_tsf.o hal_set_sta_tsf size 0x1e, hal_enable_sta_tsf size 0x26, hal_disable_sta_tsf size 0x22 and hal_set_sta_tsf_wakeup size 0x32.</source>
      <source id="BLOB_LIBPP_HAL_TSF_TIMER">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_tsf.o hal_tsf_timer_set_target size 0x22, hal_tsf_timer_get_target size 0x20, hal_enable_tsf_timer_wakeup size 0x18, hal_disable_tsf_timer_wakeup size 0x1a, hal_enable_tsf_timer size 0x3a and hal_disable_tsf_timer size 0x30.</source>
      <source id="BLOB_LIBPP_HAL_TSF_RUNTIME">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_tsf.o hal_enable_nan_tsf size 0x26, hal_disable_nan_tsf size 0x22, hal_disable_softap_tsf size 0x12, hal_set_sta_tbtt size 0x6e, hal_set_sta_tbtt_interval size 0x18, hal_set_sta_light_sleep_wake_ahead_time size 0x16, hal_is_sta_tsf_active size 0x0c and hal_tsf_clear_soc_wakeup_request size 0x14; complete hal_mac.o hal_enable_sta_btwt_tsf size 0x3e.</source>
      <source id="BLOB_LIBPP_HAL_COEX_RUNTIME">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_coex.o hal_set_rx_beacon_time size 0x2c, hal_set_rx_beacon_pti size 0x2a, hal_clear_rx_beacon_pti size 0x12, hal_set_itwt_pti size 0x26 and hal_clr_itwt_pti size 0x16.</source>
      <source id="BLOB_LIBPP_HAL_RUNTIME_MMIO_LEAVES">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o hal_enable_sta_beacon_filter size 0x2c, hal_disable_sta_beacon_filter size 0x22 and hal_beacon_ie_crc_get size 0x0c; complete hal_mac_ctl.o hal_mac_interrupt_clr_bsscolor size 0x12, hal_he_set_hw_qos_null_ra_to_trans size 0x44 and hal_ifc_get_bb_err_bitmap size 0x30; complete hal_mac_rx.o hal_mac_rx_get_end_state size 0x0c and hal_mac_rx_get_end_info size 0x3c; complete hal_sniffer.o hal_sniffer_rx_clr_statistics size 0x1e.</source>
      <source id="BLOB_LIBPP_HAL_PWR">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_pwr.o pwr_hal_set_mac_modem_state_wakeup_protect_enable size 0x14 and disable size 0x16, plus their shared control-word leaves.</source>
      <source id="BLOB_LIBPP_HAL_HE_SET_MMSS_AND_AID">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_ctl.o hal_he_set_mmss_and_aid body, size 0x82.</source>
      <source id="BLOB_LIBPP_HAL_HE_BSSID_LIFECYCLE">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_ctl.o hal_he_bssid_init size 0x4c, hal_he_bssid_deinit size 0x1e and hal_he_set_power_save size 0x36. Interface-zero init performs four ordered fresh-read RMW edges: set WDEV_HE_BSSID0_CONF bit 31, clear bits 30:29, set WDEV_RX_POWER_SAVE_CONF bit 29, then set bit 28. _oracles/libnet80211.a sha256 92550813de20ed0d51110dbd72b646e891a86a8a2f81fa53714ebf2ebf9c8f; complete wl_cnx.o cnx_connect_to_bss size 0x2b6 calls interface-zero init after associated-STA receive policy when the peer and cipher admit HE, before clearing the color bitmap and calling hal_he_set_bss_color.</source>
      <source id="HIL_OPEN_HE_BSSID_LIFECYCLE_2026_07_30">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, open PHY/MAC, standard psram-code-psram-data profile and controlled HE20 AP, 2026-07-30. After association, WPA2/CCMP, TID0 AddBA and sustained 32-MPDU HE MCS9 transmission, typed PAC diagnostics read HE_BSSID_ENABLE=1, BSSID_SELECT=0, INTRA_PPDU_PS_ENABLE=1 and INTRA_PS_CHECK_BSS_COLOR_ENABLE=1. The AP advertised disabled BSS color 0x99, so BSS_COLOR_ENABLE correctly remained zero.</source>
      <source id="BLOB_LIBNET80211_IEEE80211_PARSE_HECAP">_oracles/libnet80211.a sha256 92550813de20ed0d51110dbd72b646e891a86a8a2f81fa53714ebf2ebf9c8f40; complete ieee80211_he.o ieee80211_parse_hecap body, size 0x2d8, including nominal-packet-padding extraction.</source>
      <source id="BLOB_LIBPP_DBG_READ_TX_PPDU">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_tx_ppdu body, size 0x3b6, and its pinned format strings. The decoder names frame-state halfword offset 0x22 msdu_len; complete mac_tx_set_tb independently sums that exact halfword into WDEVTXQBSR_SW.</source>
      <source id="ROM_REV0_PHY_DAC_SCALE_SET">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_dac_scale_set at 0x2f82873a, size 0x3c.</source>
      <source id="ROM_REV0_PHY_SET_RX_GAIN_CAL_DC">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_set_rx_gain_cal_dc at 0x2f829858, size 0x206.</source>
      <source id="ROM_REV0_PHY_START_TX_TONE_STEP">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_start_tx_tone_step at 0x2f828776, size 0x102.</source>
      <source id="ROM_REV0_PHY_START_STOP_TX_TONE">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_start_tx_tone_step at 0x2f828776, size 0x102, and phy_stop_tx_tone at 0x2f828878, size 0x30.</source>
      <source id="ROM_REV0_PHY_TXIQ_GET_MIS_PWR">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_txiq_get_mis_pwr at 0x2f82ae18, size 0xa8.</source>
      <source id="ROM_REV0_PHY_RX_DCO_CAL">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_pbus_rx_dco_cal at 0x2f828f44, size 0x228, including the bounded capture/clear/restore graph.</source>
      <source id="ROM_REV0_PHY_RX_DCO">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete RX-DCO call graph rooted at phy_pbus_rx_dco_cal at 0x2f828f44, size 0x228, and its PBUS helper leaves.</source>
      <source id="MIGRATION_HE20_PEER">Git parent of migration-promotion commit f233006, migration/esp32s31-hybrid-runtime/src/he.rs; finite HE Capability/Operation parsing and peer-register transcription subsequently promoted into open driver crates.</source>
      <source id="MIGRATION_HE20_ASSOCIATION">Git parent of migration-promotion commit f233006, migration/esp32s31-hybrid-runtime/src/he.rs and association owner; finite interface-zero MMSS/AID transcription subsequently promoted into open driver crates.</source>
      <source id="MIGRATION_RX_AMPDU">Git parent of migration-promotion commit f233006, migration/esp32s31-hybrid-runtime/src/rx_ampdu_hw.rs blob 293a864aae77f5768054b3a0a8e7b5dbe78404e5; recovered RX BlockAck transaction later promoted to crates/esp32s31/wifi/mac/src/rx_ampdu_hw.rs.</source>
      <source id="MIGRATION_TX_AMPDU">Git parent of migration-promotion commit f233006, migration/esp32s31-hybrid-runtime/src/tx_ampdu.rs blob 14b76600977613fa878d0e9838fabc4b63606bbd; recovered TX BlockAck transaction later promoted to crates/esp32s31/wifi/mac/src/tx_ampdu.rs.</source>
      <source id="HIL_OPEN_AUTH_PTI_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, open PHY/MAC and standard psram-code-psram-data profile, 2026-07-29. Five reset-to-connect runs read scheduler priority one and PTI image 0x00111110 for Authentication/Association.</source>
      <source id="HIL_VENDOR_CONNECTED_VECTOR_2026_07_29">../esp32s31_rust firmware wifi-sta-auth-probe on ESP32-S31 rev0 with the complete vendor driver, 2026-07-29. A synchronous connected HT queue snapshot read HT_DESCRIPTOR_COUNTS 0x00004081 and preserved the complete vector image before queue enable.</source>
      <source id="HIL_OPEN_HE_QUEUE_SCHEDULING_BASELINE_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, open PHY/MAC, standard psram-code-psram-data profile and controlled HE20 AP, 2026-07-29. After HE association, WPA2 and TID0 AddBA, all ordinary-SU TB_ENA fields and Trigger/TB counters remained zero; MU-EDCA timers were disabled with REACHED=1.</source>
      <source id="HIL_OPEN_HE_RATE_CONTROL_ACK_SNR_2026_07_30">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, open PHY/MAC, standard psram-code-psram-data profile and FRITZ!Box 7530 FN HE20 channel 1, 2026-07-30. The owned Dot11Ax/1 schedule selected rate byte 0x19; the typed arena decoder published HE MCS9, two LTFs/1600 ns and peer-qualified LDPC at 108.3 Mbit/s. The first three-member A-MPDU received BlockAck bitmap 0x7 and its successful PRIMARY completion decoded ACK-SNR sample 70. DHCP completed in 7 ms; a following 100-packet ICMP run had zero loss and 4.244 ms average RTT.</source>
      <source id="S31_PMU_HEADERS">ESP-IDF master commit 102122904ade11fd1ae373848f34ffd7dfb18aeb, components/soc/esp32s31/register/soc/pmu_reg.h; local esp-wifi-sys commit 2585f278d381acc67c529fa730b91739b5461359, pmu_reg.h sha256 b1a04a306b9d7ee908e2f7b083d42b7a634f8687b6ee034cfe6f54f385e0d816 and pmu_struct.h sha256 5fc84c7569f9f24e193b0205728a647768c7c289b39d5ce679c50db7d8352e28</source>
      <source id="ESP_IDF_ESP32S31_MODEM_REG_BASE">Official ESP-IDF master commit 873d612fdeebf5dadc068670d320dbf4bcd742bc, components/soc/esp32s31/include/modem/reg_base.h, sha256 86a9909938d4db06b3d11c4c386a2c3dbdcd9657b6d194a216202b796ada13b9. It defines MODEM_BASE 0x20100000, MODEM_PWR_BASE 0x2010d000 and the FE, WIFI_MAC, WIFI_BB, WIFI_BB_BRX, MODEM_TIMER, MODEM_ETM, MODEM_DATADUMP, MODEM_WIDGETS, MODEM_SYSCON, MODEM_LPCON, I2C_ANA_MST and I2C_ANA_MST_MEM sub-block bases.</source>
      <source id="ROM_REV0_PHY_OPEN_FE_BB_CLK">_oracles/esp32s31_rev0_rom.elf phy_open_fe_bb_clk at 0x2f823ec0, complete 0x38-byte body</source>
      <source id="ROM_REV0_PHY_FE_REG_INIT">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_fe_reg_init at 0x2f827740 size 0xf6</source>
      <source id="ROM_REV0_PHY_ADC_RATE">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_adc_rate_set at 0x2f82a6d2 size 0x4a</source>
      <source id="ROM_REV0_PHY_TXDC_CAL">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_txdc_cal at 0x2f82abbe size 0x1dc</source>
      <source id="ROM_REV0_PHY_PBUS">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_pbus_force_mode at 0x2f824102 size 0x90 and phy_pbus_force_test at 0x2f824228 size 0x42, plus phy_pbus_rd address/shift jump tables</source>
      <source id="ROM_REV0_PHY_SET_PBUS_MEM">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_set_pbus_mem at 0x2f82479e size 0x180</source>
      <source id="ROM_REV0_PHY_WRITE_PBUS_MEM">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_write_pbus_mem at 0x2f824634 size 0x16a</source>
      <source id="ROM_REV0_PHY_SAVE_PBUS_REG">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_save_pbus_reg at 0x2f824602 size 0x32</source>
      <source id="ROM_REV0_PHY_WRITE_GAIN_MEM">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_write_gain_mem at 0x2f8274f0 size 0x2a</source>
      <source id="ROM_REV0_PHY_AGC">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_disable_agc at 0x2f827460 size 0x10, phy_enable_agc at 0x2f827470 size 0x28, phy_rx_11b_opt at 0x2f827588 size 0xc4, phy_agc_reg_init at 0x2f8278d8 size 0xd8, phy_bb_agc_reg_update at 0x2f82860e size 0xa6 and phy_rfrx_sat_rst at 0x2f828944 size 0x42</source>
      <source id="ROM_REV0_PHY_LOW_RATE">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_enable_low_rate at 0x2f825210 size 0x20 and phy_disable_low_rate at 0x2f825230 size 0x20. Each performs three fresh-read RMW edges: bits 10 and 11 at 0x20108060 separately, then bit 11 at 0x2010807c.</source>
      <source id="ROM_REV0_PHY_ANT_INIT">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_ant_init at 0x2f827df4 size 0x44</source>
      <source id="ROM_REV0_PHY_ANT_DFT_CFG">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_ant_dft_cfg at 0x2f82508a size 0x22</source>
      <source id="ROM_REV0_PHY_BTBB_WIFI_BB_CFG2">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_btbb_wifi_bb_cfg2 at 0x2f8279b0 size 0x16</source>
      <source id="ROM_REV0_PHY_CHAN_DUMP_CFG">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_chan_dump_cfg at 0x2f8251c0 size 0x50</source>
      <source id="ROM_REV0_PHY_DAC_RATE">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_dac_rate_set at 0x2f82a71c size 0x26</source>
      <source id="ROM_REV0_PHY_FORCE_PWR_INDEX">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_force_pwr_index at 0x2f82817c size 0x3a</source>
      <source id="ROM_REV0_PHY_FORCE_RX_GAIN">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_force_rx_gain at 0x2f8281f4 size 0x2c</source>
      <source id="ROM_REV0_PHY_RX11BLR_CFG">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_rx11blr_cfg at 0x2f8253b8 size 0x38</source>
      <source id="ROM_REV0_PHY_CCA_CONTROL">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_disable_cca at 0x2f827498 size 0x32 and phy_enable_cca at 0x2f8274ca size 0x26</source>
      <source id="ROM_REV0_PHY_SIFS_REG_INIT">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_sifs_reg_init at 0x2f828532 size 0x44</source>
      <source id="ROM_REV0_PHY_CLOCK_FORCE">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_force_txrx_off at 0x2f827bb0 size 0x66, phy_set_txclk_en at 0x2f827cd2 size 0x24 and phy_set_rxclk_en at 0x2f827cf6 size 0x20</source>
      <source id="ROM_REV0_PHY_I2C">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_i2c_clk_sel at 0x2f829f1c size 0x68, phy_i2cmst_reg_init at 0x2f8276c4 size 0x22, phy_bbpll_cal at 0x2f827dbc size 0x1c, phy_i2c_master_reset at 0x2f8260d0 size 0x74, phy_chip_i2c_readReg_org at 0x2f829ffa and phy_chip_i2c_writeReg at 0x2f82a30e</source>
      <source id="ROM_REV0_PHY_FREQUENCY_CHANNEL">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_freq_module_resetn at 0x2f824abe size 0x1c, phy_freq_chan_en_sw at 0x2f824ada size 0x38, phy_freq_i2c_mem_write at 0x2f824bb6 size 0x3e, phy_freq_reg_init at 0x2f824c46 size 0x60, phy_freq_num_get_data at 0x2f824ca6 size 0x24, phy_freq_i2c_num_addr at 0x2f824cca size 0x6a, phy_en_hw_set_freq at 0x2f824f9e size 0x14, phy_dis_hw_set_freq at 0x2f824fb2 size 0x14, phy_bb_bss_cbw40 and child at 0x2f826052, phy_mac_tx_chan_offset at 0x2f827550 size 0x38, phy_mac_enable_bb at 0x2f827836 size 0x2a, phy_bb_reg_init at 0x2f8279c6 size 0x140, phy_wifi_fbw_sel at 0x2f827e38 size 0x58, phy_bt_filter_reg at 0x2f827e90 size 0x34, phy_nrx_freq_set at 0x2f8280ec size 0x32, phy_wifi_enable_set at 0x2f828220 size 0x18, phy_bb_cbw_chan_cfg at 0x2f828238 size 0x74 and phy_i2c_master_mem_txcap at 0x2f82a832 size 0x24</source>
      <source id="ROM_REV0_PHY_REGISTER_INITIALIZATION">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_reg_init at 0x2f823ef8 size 0x52, phy_tx_paon_set at 0x2f82764c size 0x78, phy_bb_wdg_cfg at 0x2f827860 size 0x2c, phy_bb_reg_init at 0x2f8279c6 size 0x140, phy_noise_floor_auto_set at 0x2f827d3c size 0x36, phy_iq_corr_enable at 0x2f827d8c size 0x24 and phy_i2c_txrate_init at 0x2f8286d0 size 0x38</source>
