ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
      <source id="ROM_REV0_PHY_CBW_FEATURE_WATCHDOG">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; register-access evidence from complete phy_bb_cbw_chan_cfg, phy_vht_support, phy_csidump_force_lltf_cfg, phy_hemu_ru26_good_res, phy_freq_band_reg_set, phy_bbtx_outfilter, phy_bb_wdt_rst_enable, phy_bb_wdt_int_enable, phy_bb_wdt_timeout_clear, phy_bb_wdt_get_status and phy_lltf_mask_en bodies; machine comparison is owned by tools/phy-trace</source>
      <source id="ROM_REV0_PHY_READ_NOISE_FLOOR">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_read_hw_noisefloor at 0x2f827d72, size 0x1a. It reads 0x2010708c, masks the low twelve bits, subtracts 0x1000, sign-extends and arithmetic-shifts right by two.</source>
      <source id="HIL_OPEN_STA_RATE_CONTROL_2026_07_30">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, open PHY/MAC, standard psram-code-psram-data profile and nearby FRITZ HE20 peer, 2026-07-30. The generated PAC plus complete ROM/wDev transform read -92 dBm, scan RSSI was -20 dBm and the blob-compatible signed-byte metric was 72. The Rust-owned association selected Dot11Ax schedule 1, rate code 0x19, maximum schedule 13, 16 entries and BF report mode/rate 1/16. WPA2/CCMP, TID0/TID7/TID5 AddBA, a three-subframe TX A-MPDU and DHCP completed; 100/100 ICMP packets completed with 3.692 ms mean RTT and zero driver RX drops or duplicates.</source>
      <source id="ROM_REV0_PHY_POWER_DETECTOR">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_pwdet_reg_init at 0x2f82634a size 0x5c, phy_pwdet_sar2_init at 0x2f8263a6 size 0x34, phy_en_pwdet at 0x2f8263da size 0x26, phy_tx_pwctrl_bg_init at 0x2f8267f6 size 0x1e, phy_get_fm_sar_dout at 0x2f8264b2 size 0x2a, phy_get_tone_sar_dout_ at 0x2f8266da size 0x40 and phy_txcal_debuge_mode_ at 0x2f8244fe size 0x56</source>
      <source id="ROM_REV0_PHY_IQ_COEFFICIENTS">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_txiq_set_reg at 0x2f827c16 size 0x68 and phy_rxiq_set_reg at 0x2f827c7e size 0x54</source>
      <source id="ROM_REV0_PHY_IQ_ESTIMATOR">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_iq_est_enable at 0x2f8289d4 size 0xb4, phy_iq_est_disable at 0x2f828a88 size 0x2c, phy_dc_iq_est at 0x2f828ab4 size 0x84, phy_rxiq_get_mis at 0x2f828b84 size 0x13e, phy_set_rx_gain_cal_iq at 0x2f82964c size 0x20c and phy_get_rx_sig_pwr at 0x2f829ea2 size 0x76</source>
      <source id="ROM_REV0_PHY_WAIT_I2C_SDM_STABLE">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_wait_i2c_sdm_stable at 0x2f823e76 size 0x4a</source>
      <source id="BLOB_LIBPHY_PHY_I2C">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_i2c.o callbacks and phy_i2c_master_cmd_mem_init</source>
      <source id="BLOB_LIBPHY_PHY_GET_XTAL_FREQ">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_init.o phy_get_xtal_freq body, size 0x40</source>
      <source id="BLOB_LIBPHY_PHY_RXIQ_CAL_INIT">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_rx_gain.o phy_rxiq_cal_init body, size 0x198</source>
      <source id="BLOB_LIBPHY_REGISTER_CHIPV7_PHY">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_init.o register_chipv7_phy body, size 0x1e6, and relocation graph</source>
      <source id="BLOB_LIBPHY_PHY_RFPLL_CHANNEL">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_rfpll.o phy_chip_set_chan body, size 0x10e, and its finite ROM leaf call graph</source>
      <source id="BLOB_LIBPHY_PHY_SET_TX_CFR_MEM">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_tx_gain.o phy_set_tx_cfr_mem body, size 0x76</source>
      <source id="BLOB_LIBPHY_PHY_SET_TX_GAIN_MEM_NEW">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_tx_gain.o phy_set_tx_gain_mem_new body and complete ROM phy_write_gain_mem leaf</source>
      <source id="BLOB_LIBPHY_PHY_OPEN_I2C_XPD_NEW">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_reg.o phy_open_i2c_xpd_new body</source>
      <source id="BLOB_LIBPHY_PHY_REG_UPDATE_NEW">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_init.o phy_reg_update_new body, complete phy_reg.o phy_set_ftm_en tail and complete rev0 ROM phy_wifi_agc_sat_gain at 0x2f827db0 size 0x0c</source>
      <source id="BLOB_LIBPHY_PHY_SET_RX_GAIN_TABLE">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_rx_gain.o phy_set_rx_gain_table body, including the final two register limit writes at offsets 0x1fe through 0x246</source>
      <source id="BLOB_LIBPHY_PHY_SET_RX_COMP_NEW">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_reg.o phy_set_rx_comp_new body, size 0x28</source>
      <source id="BLOB_LIBPHY_PHY_DC_MEM_CLR">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_reg.o phy_dc_mem_clr body, size 0x1c</source>
      <source id="BLOB_LIBPHY_PHY_CLOSE_FE_BB_CLK">_oracles/libphy.a phy_init.o phy_close_fe_bb_clk, complete 0x20-byte body</source>
      <source id="BLOB_LIBPHY_PHY_BB_INIT">_oracles/libphy.a phy_init.o phy_bb_init, complete 0x16a-byte body and relocation graph</source>
      <source id="BLOB_LIBPHY_PHY_BASEBAND_CONFIG">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_reg.o phy_bb_txpwr_track size 0xf4 and phy_txgain_comp_pacfg_new size 0x54</source>
      <source id="BLOB_LIBPHY_PHY_CFR_CONTROL">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_reg.o phy_iccfr_en size 0x2c, phy_force_iccfr size 0x7a and phy_config_hccfr size 0x38</source>
      <source id="BLOB_LIBPHY_PHY_FE_REG_UPDATE">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_reg.o phy_fe_reg_update size 0x32</source>
      <source id="BLOB_LIBPHY_PHY_TXDC_PWDET">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_tx_cal.o phy_txdc_cal_pwdet_init size 0x208</source>
      <source id="BLOB_LIBPHY_PHY_CHECK_RX_SAT">_oracles/libphy.a sha256 51497819736295c9b33d6775495dade4c6fb39db887edfe095608c670d9ae223; complete phy_rx_cal.o phy_check_rx_sat body, size 0x76, and relocation graph</source>
      <source id="ROM_REV0_WDEV_APPEND_RX_BLOCKS">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete wDev_AppendRxBlocks at 0x2f838a7e size 0x132, including descriptor rearm/sentinels, live old_tail.next publication, RX_CONTROL bit-0 reload, RX_NEXT_DESCRIPTOR terminal test and RX_DESCRIPTOR_BASE repair</source>
      <source id="ROM_REV0_HAL_MAC_RX_GATE">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete hal_mac_rx_enable at 0x2f8386c0 size 0x14 and hal_mac_rx_disable at 0x2f8386d4 size 0x12; set and clear RX_CONTROL bit 31</source>
      <source id="ROM_REV0_HAL_MAC_RX_LAST_DESCRIPTOR">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete hal_mac_rx_get_last_dscr at 0x2f8386a2 size 0x1e; joins RX_LAST_DESCRIPTOR low 20 bits with RX_DESCRIPTOR_HIGH_WINDOW high 12 bits</source>
      <source id="BLOB_LIBPP_HAL_MAC_RX_BLOCK_ACK">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_ampdu.o hal_agreement_add_rx_ba size 0x12e, hal_agreement_clr_rx_ba size 0xbe, hal_agreement_del_rx_ba size 0x72, hal_ba_session_store size 0x4e, hal_ba_session_restore size 0x66 and hal_ba_session_restore_by_hw_index size 0x6c. These leaves prove eight reverse-addressed ordinary banks at 0x20104178..0x20104294 with stride 0x24, live-state/load-word pairs, and update bits zero through seven. Complete extra-SoftAP leaves independently prove the shared staging window at 0x20104ea4..0x20104eb8 plus commit/readback bits eight and nine.</source>
      <source id="BLOB_LIBNET80211_RX_BLOCK_ACK">_oracles/libnet80211.a sha256 92550813de20ed0d51110dbd72b646e891a86a8a2f81fa53714ebf2ebf9c8f40; complete ieee80211_ht.o ampdu_rx_start.constprop.0 size 0x186 and complete ht_recv_action_ba_addba_request containing the ordinary receive-BA activation branch with the ic_add_rx_ba relocation. ht_recv_action_ba_addba_request extracts a four-bit TID and rejects values with bit three set, admitting TIDs 0 through 7. ampdu_rx_start selects min(peer-requested window, g_wifi_menuconfig+0x30) for a nonzero request, or the configured window otherwise. The later ordinary activation passes constant 64 as the sixth ic_add_rx_ba argument; if_hwctrl.o only swaps interface/index before tail-calling complete hal_agreement_add_rx_ba.</source>
      <source id="HIL_OPEN_RX_BLOCK_ACK_DIRECT_BANK_2026_07_30">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, fully open PHY/MAC, standard psram-code-psram-data profile and FRITZ!Box 7530 FN HE20 channel 1, 2026-07-30. The AP requested TID0 RX BlockAck at starting sequence five and negotiated window sixteen. Immediately after the open driver programmed ordinary bank zero, typed PAC readback at 0x20104274 reported control 0xc0000001, peer dc:15:c8:54:bc:1e, interface zero, window sixteen, current and loaded sequences five, and zero bitmaps. After two independent 500-packet ICMP receive runs, the hardware-maintained current-sequence word advanced first to 491 and then to 992 while the loaded starting sequence remained five. This qualifies the direct-bank geometry, field packing, publication update bit and live-state/load split; it does not qualify the separate extra-SoftAP staging path.</source>
      <source id="BLOB_LIBPP_HAL_MAC_TX_BLOCK_ACK">_oracles/libpp.a pinned ESP32-S31 archive; complete hal_mac_tx_get_blockack leaf recovered into MIGRATION_TX_AMPDU and moved to crates/esp32s31/wifi/mac/src/tx_ampdu.rs. Queue register banks descend by 0x7c bytes. No independent HIL qualification yet.</source>
      <source id="BLOB_LIBPP_HAL_TX_TRIGGER_FLOW">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_tx.o hal_mac_get_txq_in_trig_flow_state size 0x0c and complete lmac.o lmacProcessTxComplete size 0x25c, lmacProcessShortRetryFail size 0x318, lmacProcessLongRetryFail size 0x266 and lmacProcessTBSuccess size 0x52. The HAL getter reads 0x20104cb4 and returns its complete high byte. The completion dispatcher right-shifts that byte by the completed queue index, masks bit zero and retains the resulting per-queue trigger-flow flag. On a zero-retry-count ACK/retry failure, both retry-failure paths use that flag to terminate through lmacProcessTBSuccess instead of scheduling an ordinary contention retry; the success completion path remains lmacProcessTxSuccess.</source>
      <source id="BLOB_LIBPP_HAL_CRYPTO">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_crypto.o hal_crypto_clr_key_entry, hal_crypto_set_key_entry, hal_crypto_is_key_valid, hal_crypto_enable and hal_crypto_disable bodies. The active open STA pairwise/group images were first preserved in migration/esp32s31-hybrid-runtime/src/wpa2_s31.rs and now live in crates/esp32s31/wifi/mac/src/crypto.rs.</source>
      <source id="BLOB_LIBPP_HAL_CRYPTO_INIT">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_crypto.o hal_crypto_init body. It proves five ordered full-word stores at 0x20104800, 0x20104804, 0x20104808, 0x2010480c and 0x20104810 with images 0x00030000, 0x00030000, zero, zero and zero.</source>
      <source id="BLOB_LIBPP_HAL_MAC_SET_ADDR">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o hal_mac_set_addr body. It proves the four-interface 0x8-byte stride and, per interface, one full low-address store, one full high-address store, then one fresh-read RMW setting bit 16.</source>
      <source id="BLOB_LIBPP_HAL_MAC_SET_BSSID">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o hal_mac_set_bssid body, size 0x5a. It proves the four-interface 0x8-byte stride and exact ordered transaction: clear high-word bit 31, full-store BSSID bytes 0..3, fresh-read replace high-word bits 15..0 with bytes 4..5, then fresh-read set bit 31.</source>
      <source id="BLOB_LIBPP_HAL_ENABLE_MAC">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o hal_enable_mac body, size 0x18. It performs one fresh-read RMW clearing bits 7:4 at 0x20104c00, then stores its full event-mask argument at 0x20104c40. Complete hal_disable_mac independently sets the same four gate bits before clearing interrupt state.</source>
      <source id="BLOB_LIBPP_HAL_INIT_PREFIX">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o hal_init body, offsets 0x00..0x3a. It proves the 0x20104de0 REQUEST-bit RMW, READY-bit polling loop, then the ordered interrupt-disable and all-events-clear stores.</source>
      <source id="BLOB_LIBPP_HAL_SNIFFER_ENABLE">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_sniffer.o hal_sniffer_enable body. At queue-three word 0x201040e4 it proves seven ordered fresh-read RMWs: set bit 17; clear bits 0, 1, 2, 3 and 8 separately; then clear bits 7 and 9 together.</source>
      <source id="BLOB_LIBPP_HAL_SNIFFER_MISC">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_sniffer.o hal_sniffer_set_promis_misc_pkt body, size 0x84. It independently proves the shared 0x201040f4 misc-packet policy register and its mode-dependent fields. The open frontier uses only the separately HIL-qualified bits 15:8 and does not claim the other vendor branches.</source>
      <source id="OPEN_DRIVER_PROMISCUOUS_RX_FRONTIER">open-esp-radio-rs commit 6a2b358b6dc3458d2f49d80ff14d20aa3d6fabab, crates/esp32s31/wifi/mac/src/init.rs, first source-owned open promiscuous RX frontier; subsequently qualified by the connected ESP32-S31 rev0 scan/STA run recorded as HIL_OPEN_RX_LIVE_APPEND_2026_07_27. It publishes zero at 0x20104cac, executes complete BLOB_LIBPP_HAL_SNIFFER_ENABLE, sets bits 15:8 at 0x201040f4 through one fresh-read RMW, then issues a device fence.</source>
      <source id="BLOB_LIBPP_MAC_RXBUF_INIT_PREFIX">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o mac_rxbuf_init body. Its first four RMWs touch 0x20104c68, 0x20104c6c, 0x20104c70 and 0x2010407c. The final store publishes the external wDevCtrl descriptor pointer at 0x20104084 and deliberately remains owned by the RX ring transaction rather than this prefix.</source>
      <source id="BLOB_LIBPP_MAC_LAST_RXBUF_INIT">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o mac_last_rxbuf_init body, size 0xd2. It performs eighteen ordered full-word stores for six three-word entries at 0x20104124..0x20104170, then two separate fresh-read RMWs setting 0x3f00 and 0x007e at 0x20104120, followed by one fresh-read RMW setting bit 27 at 0x20104098.</source>
      <source id="BLOB_LIBPP_MAC_TXRX_INIT_PREFIX">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o mac_txrx_init body, direct prefix offsets 0x08..0xd0 before its first external call at 0xd2. It proves eighteen fresh-read RMW edges. The following hal_he_set_mac_delay, hal_he_set_ack_rate and hal_he_set_bbrxhung_time calls are deliberately outside this source entry.</source>
      <source id="BLOB_LIBPP_MAC_TXRX_CALLBACKS">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_ctl.o hal_he_set_mac_delay (size 0x180), hal_he_set_ack_rate (size 0x156), and hal_he_set_bbrxhung_time (size 0x1e), reached from complete hal_mac.o mac_txrx_init with zero arguments for the latter two. g_wifi_osi_funcs layout is independently pinned by esp-wifi-sys commit 72b97e6fe55307aa92c8c1edf3fdb3f4df816e80, esp-wifi-sys-esp32s31/src/include.rs sha256 de6ecd8853cc1925389f89e768a8a865ad58db6025f94a63584096eb8ad5f1dc and c/headers/esp32s31/esp_private/wifi_os_adapter.h sha256 08fb73f76da7e6800c42dbff2fb724dff5205e1c8262e969da0f391be21f1eae: offset 0x04 is _env_is_chip and offset 0x144 is _random. esp-hal branch esp32s31-async-platform commit 07de55443721de6fa32e7fb721f0fa7996e604d3, esp-radio/src/wifi/os_adapter/mod.rs sha256 cf8439e907161228875d852eb1e4cfa45628b62532bfbe4bc8adcebd8c6112ed and esp-radio/src/common_adapter.rs sha256 6e9ef6acc2236d29e7b2ef2ed957eaa878c8f5f767a77ecff19b6711e135ab34 prove the real-chip adapter returns true and sources _random from esp_hal::rng::Rng. The on-chip blob path uses that value modulo 11; the previously transcribed fixed values were the FPGA branch. Diagnostic log calls after hardware writes do not alter MMIO and are omitted.</source>
      <source id="BLOB_LIBPP_MAC_TXRX_INIT_SUFFIX">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o mac_txrx_init body, direct suffix offsets 0xee..0x16e after the hal_he_set_mac_delay, hal_he_set_ack_rate and hal_he_set_bbrxhung_time calls. It proves nine fresh-read RMW edges ending with RX_CONTROL walker-disable bit 31 clear.</source>
      <source id="BLOB_LIBPP_HAL_INIT_RX_POLICY">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o hal_init offsets 0x56..0x90 and complete hal_mac_rx_set_policy body, size 0xd2. For each of four queues hal_init performs four direct fresh-read RMWs at 0x201040d8 + 4*q, then calls hal_mac_rx_set_policy(q,0,0,0). Queues 0..2 each add five leaf RMWs across filter, BSSID-high and interface-address-high; queue 3 is rejected by the leaf after its four direct RMWs. The complete cold transaction is therefore 31 distinct RMW edges.</source>
      <source id="BLOB_LIBPP_HAL_INIT_TAIL">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o hal_init offsets 0xcc..0x12a, complete hal_mac_rx.o hal_mac_set_rxbuf_reload_use_hw_beacon_enable size 0x14, and complete hal_tsf.o hal_timer_update_by_rtc size 0x38. This bounded tail stores interrupt mask 0x19a879e0, repeats the bit-28 set at 0x20104c8c, performs two separate byte RMWs at 0x20104098, sets RX_CONTROL bit 27, then enables RTC timer update and publishes an 18-bit slow-clock calibration. g_wifi_osi_funcs offset 0x148 is independently pinned as _slowclk_cal_get by esp-wifi-sys commit 72b97e6fe55307aa92c8c1edf3fdb3f4df816e80, esp-wifi-sys-esp32s31/src/include.rs sha256 de6ecd8853cc1925389f89e768a8a865ad58db6025f94a63584096eb8ad5f1dc and c/headers/esp32s31/esp_private/wifi_os_adapter.h sha256 08fb73f76da7e6800c42dbff2fb724dff5205e1c8262e969da0f391be21f1eae. esp-hal branch esp32s31-async-platform commit 07de55443721de6fa32e7fb721f0fa7996e604d3, esp-radio/src/wifi/internal.rs sha256 252cfe7cfdcdb104a91596fcbc173af6e07432b907480df746d0599463c6cdc7 and esp-radio/src/wifi/os_adapter/mod.rs sha256 cf8439e907161228875d852eb1e4cfa45628b62532bfbe4bc8adcebd8c6112ed prove that S31 installs this callback and currently returns zero with an explicit TODO rather than reading extra peripheral MMIO.</source>
      <source id="BLOB_LIBPP_HAL_INIT_COEX">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o hal_init offsets 0x12e..0x190; complete hal_coex.o hal_coex_pti_init size 0x12, hal_set_rx_active_pti size 0x14, hal_set_rx_ack_pti size 0x1a, hal_set_wifi_default_pti size 0x14, hal_set_ofdma_sequence_pti size 0x13a, hal_set_tb_pti size 0xb4, hal_set_beamf_pti size 0x34 and hal_set_beamf_mt_pti size 0x32; complete hal_mac_ctl.o hal_coex_enable_default_pti size 0x18. These bodies prove seventeen separate cold RMW edges. The OSI callback at offset 0x1a8 is _coex_pti_get in the independently pinned S31 esp-wifi-sys layout. The esp-hal no-coex stub at commit 07de55443721de6fa32e7fb721f0fa7996e604d3 returns zero without initializing its output pointer. hal_init preinitializes its ordinary RX outputs, but hal_set_ofdma_sequence_pti does not initialize twelve stack outputs before reading them; reproducing that disabled-feature path would therefore publish indeterminate data and is deliberately rejected in favor of an explicit platform PTI source.</source>
      <source id="BLOB_LIBCOEX_PTI_TABLE">_oracles/libcoexist.a sha256 4b00fc4258ac3a7bef3ecd6c0f402d38afde9aafe50ceaf07951406cff576276; complete coexist_api.o coex_pti_get tail-calls complete coexist_core.o coex_core_pti_get size 0x1e, which bounds-checks only the output pointer and copies coex_pti_tab[event]. The complete 48-byte coex_pti_tab object in coexist_core.o .dram1.2 gives cold defaults event 1 = 5, event 3 = 7, event 10 = 3 and event 15 = 1. These are the only events queried by complete hal_init and hal_set_ofdma_sequence_pti. Runtime coexistence may mutate the table, so the PAC fields do not hardcode these policy values.</source>
      <source id="BLOB_LIBPP_HAL_HE_INIT_PREFIX">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_ctl.o hal_he_init offsets 0x00..0x66, complete hal_init_bf size 0xd4, complete hal_he_set_bf_report_rate size 0x7c reached with arguments (1,0x10,0,0), and complete hal_init_tb_tx size 0x1e. This bounded graph stops immediately before the hal_init_tx_pwr call at parent offset 0x6a. It proves twenty-two separate fresh-read RMW edges and a final volatile read at 0x20107128. In particular, parent clears bit 31 and then bits 31:30 at 0x20104c80 separately; hal_init_bf replaces the entire low byte at 0x20104c78 rather than preserving bit zero; and hal_init_tb_tx clears bits 15 and 14 at 0x20104e04 through separate RMWs.</source>
      <source id="BLOB_LIBPP_HAL_HE_UL_MU_OMC">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e, complete hal_mac_ctl.o hal_he_set_ul_mu size 0x3a; _oracles/libnet80211.a sha256 92550813de20ed0d51110dbd72b646e891a86a8a2f81fa53714ebf2ebf9c8f40, complete ieee80211_he.o wifi_htc_omc_txcb size 0x108 and its pinned format string. The callback extracts HT-Control bit 11 as ul_mu_disable and bit 17 as ul_mu_data_disable. The HAL leaf independently copies those arguments to 0x20104c80 bits 31 and 30 respectively through two fresh-read RMWs.</source>
