ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
      <source id="BLOB_LIBPP_HAL_HE_TB_DIAGNOSTICS">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_ctl.o hal_he_get_rx_trigger_cnt size 0x0e, hal_he_get_tb_times_cnt size 0x0e and hal_he_get_tb_qosnull_cnt size 0x0c; complete hal_debug.o get_txtb_sym_num size 0x10, get_txtb_psdu_len size 0x0e, get_txtb_min_subframe size 0x10, get_txtb_time_pe size 0x0c, dbg_read_axtb_diag size 0x102 and esp_test_get_hw_tb_statistics size 0x56. Field semantics and spellings for 0x201044f4..0x20104500 come from the complete debug function's own WDEVAXTBDIAG0..3 format strings and matching instruction-exact shifts/masks.</source>
      <source id="BLOB_LIBPP_HAL_BF_CONFIG">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_ctl.o hal_init_bf size 0xd4, hal_he_set_bf_report_rate size 0x7c and hal_he_set_ersu_ack_rate size 0x4e; complete hal_debug.o dbg_read_rx_misc WDEVBEAMFORMCONF decode at offsets 0x3c0..0x418 and dbg_read_bfr_rate size 0x148 with its QAM16/QPSK/BPSK format strings; and complete trc.o trc_set_bf_report_rate size 0x52. The decoder proves 0x20104c78 bits 0 through 22. The report-rate decoder proves three 9-bit profiles at 0x20104464, high to low as QAM16, QPSK and BPSK; the setter and trc policy prove each profile packs normalized rate bits 4:0, signal mode bits 6:5, DCM bit 7 and ER-SU bit 8. The trc leaf then tail-calls hal_he_set_ersu_ack_rate: its four fresh-read byte RMWs publish 0x80 for argument zero or 0xa0 for nonzero at 0x20104404.</source>
      <source id="BLOB_LIBPP_TEST_BF_SET_FEEDBACK">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete test_hal.o esp_test_bf_set_feedback size 0x182. The zero-enable branch clears 0x20104e00 bit 23. The enabled path sets bit 23, clears bits 22:20, replaces argument fields 13:7 and 6:0, and applies all bounded selector branches zero through sixteen across bits 22:14 plus 0x2010409c bits two and three. This is an instruction-exact test configuration leaf, not evidence that production sounding calls it or that selector numeric meanings are known.</source>
      <source id="BLOB_LIBPP_HAL_BF_DEBUG_CONTROL">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_disable_report_cbf size 0x42. A nonzero disable argument clears 0x20104c78 bit 20; zero sets it. The function then reads back and logs that same bit. Together with dbg_read_rx_misc label HE_BEAM_ENA, this proves the compressed-beamforming-report output polarity without creating a new address.</source>
      <source id="BLOB_LIBPP_BFR_AVERAGE_SNR">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o esp_test_get_bfr_avgsnr size 0x86 and its pinned “Average SNR” format string. It reads 0x20105f94 low byte as stream-zero code, treats 0x7f as the special greater-than-or-equal case, and otherwise computes (code + 88.0) * 0.25 dB using the complete function-local float constants.</source>
      <source id="BLOB_LIBPP_DBG_READ_TX_SIG">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_tx_sig size 0x350 and its pinned HT, VHT, HE, HT20-length and HT40-length format strings. The complete body selects interpretation from per-queue PLCP_FORMAT, then proves all documented shifts/masks at 0x201054e8..0x20105510-q*0x7c and the matching reverse-addressed queue-protection word.</source>
      <source id="BLOB_LIBPP_DBG_DUMP_RX_PPDU">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_dump_rx_ppdu size 0xa36, extracted object sha256 2d3eb6f1123aba62387d98864ecfe1ececc507e52f7f8b72a3efaf40cc5042e5. In the HE-SU and HE-extended-range-SU branch at offsets 0x1b0..0x280, instructions at 0x1e6..0x1ec shift the captured HE-SIG-A1 word right by 23 and mask three bits. The pinned format string at section offset 0x1b0 names that value nsts_and_midamble_periodicity.</source>
      <source id="BLOB_LIBPP_DEBUG_STATISTICS_CONTROL">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_clr_hw_count size 0x08 and reachable esp_test_clr_hw_statistics size 0x30. The wrapper tail-calls the leaf, which sets 0x20104c00 bit 16, pulses 0x20104308 bit 0 high then low, and clears 0x20104c00 bit 16 using fresh reads before every write.</source>
      <source id="BLOB_LIBPP_HAL_RX_DEBUG_COUNTERS">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_color_collision size 0x64 and dbg_read_rx_count size 0x21a, including their pinned format strings. The former proves the BSS-color bitmap words at 0x20104040/44 and RX_HE_BSS_COLOR_CONF fields at 0x20104048. The latter proves 39 named RX statistics, their sparse addresses and widths, including signed high-halfword CFO multiplied by 40 and the hang/panic words at 0x20104c64 and 0x20104e18/1c.</source>
      <source id="BLOB_LIBPP_HAL_RX_MISC_DEBUG">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_rx_misc size 0x42a and its pinned .rodata.dbg_read_rx_misc.str1.4 strings. The instruction-exact loads, shifts and masks decode WDEVRX_ABORT, WDEVDAHI/DALO, WDEVBSSIDHI/LO, WDEVTXRX_TAB, WDEV_HE_BSSID0_CONF, WDEVAXOPTIONS1/2, WDEVRXCTR_BSSIDLIST, WDEVRX_POWER_SAVE_CONF and WDEVBEAMFORMCONF at their exact 0x20104xxx addresses.</source>
      <source id="BLOB_LIBPP_HAL_RESPONSE_RATE_DEBUG">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_ack_rate and dbg_read_cts_rate, each size 0x11e, including their pinned ACK_TAB0/1, ACK_SCCKTAB, CTS_TAB0/1 and CTS_SCCKTAB strings. Their instruction-exact byte extraction proves six consecutive response-rate words at 0x2010444c..0x20104460 and the named byte lanes.</source>
      <source id="BLOB_LIBPP_HAL_WDEV_DELAY_DEBUG">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_wdevdelay size 0x5c and its pinned WDEVDELAY/WDEVDELAY1 format strings. It reads 0x20104c58 and 0x20104c54 and extracts bits 20:10 as WDEV_RXCCK_DELAY and WDEV_TXCCK_DELAY respectively.</source>
      <source id="HIL_OPEN_RX_STATISTICS_BASELINE_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, standard psram-code-psram-data profile, complete open PHY and MAC, controlled AX211 HE20 WPA2 AP on channel 11, 2026-07-29. After HE association, WPA2, successful TID0 AddBA window 32 and one complete 30-profile HE matrix round, the typed snapshot observed MPDU 6216, end 6197, data-success 286, FCS 42, power-drop 42, HT-SIG error 8, HE-SIG-A CRC 1, ACK interrupt 25 and RTS interrupt 6. FIFO overflow, buffer full, TKIP, abort and all four hang/panic counters were zero. The color bitmap had bit 25 set, threshold one and timeout 60 seconds. Four subsequent 30-profile matrix rounds remained clean.</source>
      <source id="HIL_OPEN_HE_RX_CONFIGURATION_BASELINE_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, standard psram-code-psram-data profile, complete open PHY and MAC, controlled AX211 HE20 WPA2 AP on channel 11, 2026-07-29. After HE association, WPA2, TID0 AddBA and one clean 30-profile matrix round, the allocation-free dbg_read_rx_misc snapshot observed MPDU length offset 380, NFRP threshold 8, hardware TXOP, BSR update, TB stop, TRS, UL MU and UL MU data both enabled, HE response ACK enabled, RX frequency-hop time 50, PHY signal delay 20, intra-BSS-color and intra-PPDU power save enabled, and HE beamforming with BFRP time 16, NDP time 113, hardware sequence selector 5. RX power-save itself and all three custom RX types were disabled. Trigger/TB counters and all hang/panic counters remained zero.</source>
      <source id="HIL_OPEN_HE_TB_COUNTER_BASELINE_2026_07_29">../esp32s31_rust open-radio-phy-prelude-hil on ESP32-S31 rev0 against the controlled Linux AX211 HE20 AP, 2026-07-29. After HE association, WPA2/CCMP setup and more than nineteen complete three-profile DCM A-MPDU rounds, two independent ten-second snapshots both reported RX_TRIGGER_COUNT=0, TB_TRANSMISSION_COUNT=0 and TB_QOS_NULL_COUNT=0. WDEVAXTBDIAG0..3 also remained all zero. This proves the typed read path and a no-Trigger baseline; it does not qualify OFDMA because this ordinary AP configuration did not schedule uplink Trigger frames.</source>
      <source id="HIL_OPEN_HE_BSR_TID_LIFECYCLE_2026_07_29">../esp32s31_rust open-radio-phy-prelude-hil on ESP32-S31 rev0 against the controlled Linux AX211 HE20 AP, 2026-07-29. The fully open STA completed HE association, WPA2/CCMP and a TID0 AddBA response with window 32. Applying the complete vendor TID-bitmap edge at the transition to Operational produced two independent snapshots with WDEVTXQBSR_CTRL TID_BITMAP=0x01. Hardware/software BSR values and validity bits remained zero because the AP sent no Trigger frames. Twenty-four complete three-profile DCM A-MPDU rounds reported zero failures, qualifying the TID0 lifecycle write without an HE SU regression; this does not qualify OFDMA scheduling.</source>
      <source id="HIL_OPEN_HE_TB_QUEUE_PUBLICATION_2026_07_30">../esp32s31_rust firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, standard psram-code-psram-data profile, fully open PHY/MAC against FRITZ!Box 7530 FN HE20 on channel 6, 2026-07-30. The STA completed WPA2/CCMP and TID0 AddBA window 32, then prepared 32 owned 1472-byte MSDUs using the complete ROM mac_tx_set_tb order. PAC readback before the HE queue doorbell observed logical queue two, TID0, TB_ENA=1, MU-EDCA selector two and enabled timer, contiguous MPLEN links 0 through 31 with first PSDU length 1512 and terminal link 31, plus WDEVTXQBSR_CTRL validity bit two set. The programmed WDEVTXQBSR_SW value was 47104 but its immediate post-validity read was zero; removing a non-oracle fence and reproducing the exact ROM SW(BSR), LW(CONTROL), SW(CONTROL) sequence did not change that result. The following ordinary HE20 MCS9 PPDU received a complete 32-bit BlockAck and sustained roughly 70-77 Mbit/s. RX_TRIGGER_COUNT and TB transmission counters remained zero because this AP emitted no Trigger. This qualifies the queue/link/validity publication and no-SU-regression boundary, but not the BSR read-latch semantics or over-air TB/OFDMA transmission.</source>
      <source id="BLOB_LIBPP_HAL_TX_POWER_INIT">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_tx.o hal_init_tx_pwr size 0x50 and hal_get_tx_pwr size 0x1a; complete hal_mac_ctl.o hal_init_tb_power size 0x1a0, hal_init_imrsp_power size 0x2f8, hal_mac_set_tb_max_pwr size 0x160 including both complete relocation jump tables, and hal_init_tb_ru_power size 0xba. The parent queries rates 0 through 42 in order into 43 adjacent two-byte entries. Its three children publish 56 separate fresh-read RMW edges at 0x20104408..0x20104448. Migration source is the Git parent of promotion commit f233006, migration/esp32s31-hybrid-runtime/src/lmac.rs: it consumed this same exported 86-byte s_phy_get_max_pwr table for open legacy and HT TX but did not reproduce its builder.</source>
      <source id="BLOB_LIBNET80211_PARTIAL_RU_MAX_POWER">_oracles/libnet80211.a sha256 92550813de20ed0d51110dbd72b646e891a86a8a2f81fa53714ebf2ebf9c8f40; complete ieee80211_api.o esp_wifi_internal_get_partial_ru_max_tx_pwr size 0x68 and esp_wifi_internal_set_partial_ru_max_tx_pwr size 0x62, plus complete ieee80211_ioctl.o wifi_get_partial_ru_max_txpwr_process size 0x38 and wifi_set_partial_ru_max_txpwr_process size 0x1c. The API stores the caller's first byte unchanged in the IOCTL object and the process leaf passes it unchanged to _oracles/libpp.a complete hal_mac_get_tb_max_pwr size 0x126 or hal_mac_set_tb_max_pwr size 0x160. Their relocation-complete jump tables admit raw Trigger RU selectors 0 through 8, 37 through 40, 53, 54 and 61, select one six-bit field at 0x2010443c..0x20104448, and log “the ru_alloc_num is not correct” for every other value.</source>
      <source id="ROM_REV0_PHY_GET_MAX_PWR">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete phy_get_max_pwr at 0x2f8249fe size 0x54, phy_get_target_pwr at 0x2f824976 size 0x88, phy_rate_to_index at 0x2f82491e size 0x58, phy_wifi_get_target_power at 0x2f8270fa size 0x22 and phy_get_chan_target_power at 0x2f826da4 size 0x98. Each max-power query first sets bit 14 and replaces bits 13:8 with 0x15 at 0x20107428 through separate RMWs, derives two quarter-unit target powers from live PHY calibration/channel state, clamps each to 84, arithmetic-shifts both right by two and writes two signed bytes.</source>
      <source id="BLOB_LIBPP_HAL_HE_INIT_SUFFIX">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_ctl.o hal_he_init offsets 0x7a..0x19e and complete reached hal_he_set_ersu, hal_he_set_ersu_ack_rate, hal_he_set_bcast_ru, hal_he_set_uora_parameter, hal_he_enable_dump_complete_hesigb, hal_vht_enable_bwsignaling_rts, hal_he_clr_multi_bssid and hal_he_set_co_hosted_bss leaves, plus complete hal_mac_tx.o hal_set_tx_min_pwr size 0x1a. It proves 163 writes/RMWs and two guard reads after the debug power traversal. In particular ER-SU ACK bytes are four separate RMWs, feature bits 1 and 0 at 0x20104c88 are separate, the 120-word scratch range is 0x201055f0..0x201057cc, and the parent/clear/co-hosted sequence deliberately repeats multi-BSSID fields.</source>
      <source id="BLOB_LIBPP_HAL_HE_SET_DEFAULT_PE">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_ctl.o hal_he_set_default_pe body, size 0x14. It replaces only bits 2:0 at 0x20104c80 with its three-bit argument.</source>
      <source id="BLOB_LIBPP_HAL_HE_BSR_INIT">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_ctl.o hal_he_bsr_init body, size 0x50, plus complete hal_he_bsr_ctrl and hal_he_get/set_bsr_acihigh_comp_method leaves. It proves eight ordered fresh-read RMW edges: set 0x20104c7c bits 15, 8, 7 and 6; set 0x20104c80 bit 27; clear 0x20104c7c bits 5 and 4; then replace bits 1:0 with one.</source>
      <source id="BLOB_LIBPP_HAL_HE_BSR_DEBUG">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_bsr_info size 0x268 and dbg_tb_ignore_cca_enable size 0x3c, including their pinned format strings. The first function decodes WDEVTXQBSR_CTRL, eight interleaved hardware/software BSR values, WDEVAXOPTIONS1 and WDEVAXOPTIONS2. The second proves that 0x20104c7c bit 12 set means TB cares about CCA and NAV, while clear means the debug ignore mode.</source>
      <source id="BLOB_LIBPP_HAL_HE_BSR_STATUS">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_ctl.o hal_he_get_hw_txq_bsr size 0x14. It reads 0x20104d74 plus eight times the queue/TID index and returns the low twenty bits.</source>
      <source id="BLOB_LIBPP_MAC_TX_SET_TB">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_tx.o mac_tx_set_hesig size 0x324, mac_tx_set_tb size 0x146, mac_tx_set_mplen size 0x2c4 and hal_mac_tx_clr_mplen size 0x1aa; complete if_hecfg.o wifi_he_get_hetb_tid_bitmap size 0x46 and its four-byte table [0x01,0x81,0xa1,0xa3]; complete hal_he_common.o hal_he_get_mplen_addr_start and hal_he_get_mplen_addr_end, each size 0x4a, and their tables. mac_tx_set_hesig calls mac_tx_set_tb unless descriptor-state word offset 0x30 bit 16 is set. The setter gates the QoS TID against the configured bitmap, allocates and writes a linked MPDU-length entry for every DMA frame, writes the terminal link index at 0x201054fc-q*0x7c, enables 0x20104dbc+4*q bit eight, constructs WDEVTXQ_CONF1 at 0x20104d68-0x10*q, replaces the low twenty software-BSR bits at 0x20104d78+8*q with its queued-byte accumulator, and finally ORs 1&lt;&lt;q into 0x20104db8. The default configuration value three returns bitmap 0xa1, selecting TIDs 0, 5 and 7. For that non-single-TID policy the allocator ranges are q0 32..63, q1 64..95, q2 0..31 and q3 96..119. The clear leaf walks and frees the software bitmap chain, while its only hardware-visible cleanup clears queue-control TB_ENA.</source>
      <source id="ROM_REV0_MAC_TX_SET_TB">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete mac_tx_set_hesig at 0x2f8350a8 size 0x1e2, mac_tx_set_tb at 0x2f834f82 size 0x126, mac_tx_set_mplen at 0x2f836b1a size 0x156, hal_he_get_mplen_addr_start at 0x2f836a8e size 0x46, hal_he_get_mplen_addr_end at 0x2f836ad4 size 0x46 and wifi_he_get_hetb_tid_bitmap at 0x2f839386 size 0x28. The ROM independently reproduces the same fixed-address Trigger queue, MU-EDCA, software-BSR, ready-bitmap, MPDU-link and tail writes as the blob. The newer blob adds only allocation diagnostics and a terminal-frame assertion/log around this bounded hardware transaction.</source>
      <source id="BLOB_LIBPP_HAL_HE_MU_EDCA_DEBUG">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_muedca_timer size 0x70, dbg_read_txq_conf1 size 0x86 and dbg_read_txq_conf2 size 0x80, including their pinned format strings. They decode four WDEVMUEDCA_TIMER words at 0x20104dbc..0x20104dc8, eight reverse-addressed WDEVTXQ_CONF1 words at 0x20104cf8..0x20104d68 and four reverse-addressed WDEVTXQ_CONF2 words at 0x20104d34..0x20104d64. The strings identify TID, TB enable, MU-EDCA timer select, MPDU-length link address, minimum TX power, three channel-width minimum-MPDU lengths, software RTS/CTS, timer/reset/reached and AIFS fields.</source>
      <source id="BLOB_LIBNET80211_HE_TID_BITMAP">_oracles/libnet80211.a sha256 92550813de20ed0d51110dbd72b646e891a86a8a2f81fa53714ebf2ebf9c8f40; complete ieee80211_ht.o ht_recv_action_ba_addba_response size 0x24a and ht_recv_action_ba_delba size 0xda call hal_he_set_tid_bitmap and hal_he_clr_tid_bitmap for HE nodes. _oracles/libpp.a complete hal_mac_ctl.o leaves size 0x2a and 0x2e update 0x20104db8 bits 20:13 with the selected TID bit through two reads followed by one write.</source>
      <source id="BLOB_LIBPP_HAL_HE_TRIGGER_RX_DIAGNOSTICS">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_ax_diag size 0x466 and its pinned WDEVAXDIAG0..9 format strings. The function reads 0x20104508..0x2010452c and decodes Trigger state, TB APEP length, EOF/pre-FEC padding, matched user RU/MCS/DCM/FEC/AID, common GI/LTF/bandwidth/spatial-reuse fields, TRS and packet counts. Its own warning says the words are not reliable after a following RX frame, so the PAC treats them as a best-effort diagnostic snapshot rather than durable state.</source>
      <source id="BLOB_LIBPP_DBG_READ_RX_BA">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_rx_ba size 0x9a and its pinned WDEVTXQBA_BMHI/BMLO/SSC/TID/TAHI/TALO strings. Despite its symbol name, the function walks eight TX BlockAck result banks from 0x20105528 downward with stride 0x7c.</source>
      <source id="BLOB_LIBPP_DBG_DUMP_TXQ_TXINFO">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_dump_txq_txinfo size 0x70 and its pinned WDEVTXQ_TXINFO/BA/ACK/ACK_TID/LAST_TX_IS_TB/TB_PACK_SENT string. It reads the queue-information word at 0x20105524-q*0x7c and the upper result fields of 0x20105534-q*0x7c.</source>
      <source id="BLOB_LIBPP_DBG_READ_INTERNAL_TXBA">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_internal_txba size 0x66 and its pinned WDEVTXBA bitmap, transmitter-address, fragment, SSN and TID strings. It reads five consecutive words at 0x2010429c..0x201042ac.</source>
      <source id="BLOB_LIBPP_DBG_READ_KEY_ENTRY">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_key_entry size 0x1cc and its pinned key-entry strings. The queue selector reads 0x201054d8-q*0x7c bits 22:17 and 24:23, then indexes the ten-word key table at 0x20105800 with stride 0x28 and the validity bitmap at 0x20104814.</source>
      <source id="BLOB_LIBPP_DBG_READ_TX_MPLEN">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_tx_mplen size 0x120 and its pinned MPDU_LEN/NEXT strings. It reads 120 consecutive words at 0x201055f0..0x201057cc and extracts bits 13:0 and 20:14.</source>
      <source id="BLOB_LIBPP_HAL_HE_OBSS_NARROW_BAND_RU">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_ctl.o hal_he_disable_obss_narrow_bw_ru size 0x3e. A nonzero argument writes 0xfffff to 0x20104e9c, sets 0x20104ea0 bits 8:4 through one fresh-read RMW and bit 0 through another; zero writes zero and clears those two groups in the same order. The aggregate disabled/enabled meaning is symbol-exact, while individual bitmap/class meanings remain approximate.</source>
      <source id="BLOB_LIBNET80211_IEEE80211_PARSE_HEOPR">_oracles/libnet80211.a sha256 92550813de20ed0d51110dbd72b646e891a86a8a2f81fa53714ebf2ebf9c8f40; complete ieee80211_he.o ieee80211_parse_heopr body and pinned format string "(opr)len:%d, Default PE Duration:%d, TXOP RTS Threshold:%d(%d us), ER-SU-Disable:%d". The input points at a complete extension IE: bytes 0..2 are element ID, length and HE Operation extension ID; byte 3 bits 2:0 are passed to hal_he_set_default_pe and byte 5 bit 0 is the raw ER-SU-Disable value passed to hal_he_set_ersu. The complete BSS-color branch treats HE Operation byte six bit seven as disabled, bits 5:0 as color and bit six as partial. A controlled AP advertised raw value 0x99, so disabled is true and the effective color passed to TX is zero rather than 25.</source>
      <source id="BLOB_LIBPP_DBG_READ_TX_POWER">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_debug.o dbg_read_tx_power size 0xcc. The unconditional hal_he_init child queries PHY rates 0 through 25 while skipping rate 4, for 25 discarded two-byte results, then only reads the MAC table and logs. Through ROM_REV0_PHY_GET_MAX_PWR those otherwise diagnostic queries still cause fifty ordered RMWs at 0x20107428.</source>
      <source id="BLOB_LIBPP_HAL_ANTENNA_INIT">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_tx.o hal_attenna_init body, size 0x5e. The symbol spelling is preserved from the archive. Its first reverse traversal clears bit 2 at eight words from 0x20105510 down to 0x201051ac with stride 0x7c. Its second reverse traversal clears bit 3, sets bit 5 and clears bit 4 through three separate fresh-read RMWs per word. It finishes with separate bit-2-clear and bit-5-set RMWs at 0x201042b0. Complete hal_mac_rate_autoack_init in the same object is independently verified as a two-byte ret-only no-op.</source>
