ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
      <source id="BLOB_LIBPP_MAC_CHANNEL_SWITCH">_oracles/libnet80211.a sha256 92550813de20ed0d51110dbd72b646e891a86a8a2f81fa53714ebf2ebf9c8f40, complete wl_chm.o chm_phy_change_channel.constprop.0; _oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e, complete if_hwctrl.o ic_mac_deinit/ic_mac_init, hal_mac.o hal_mac_deinit/hal_mac_init, hal_pwr.o pwr_hal_select_wifimac_regdma_link and ret-only hal_mac_ctl.o hal_mac_set_csi_cbw. The exact vendor chain is pm_wake_up, ic_mac_deinit, phy_change_channel, hal_mac_set_csi_cbw, ic_mac_init, pm_wake_done. For WIFI_PS_NONE its bounded MMIO tail sets then clears 0x00ff1000 at 0x20104cac and selects REGDMA link four in bits 20:17 of 0x2010d83c.</source>
      <source id="MIGRATION_CHANNEL_SWITCH">Git parent of migration-promotion commit f233006, migration/esp32s31-hybrid-runtime/src/channel_switch.rs and src/radio_hal.rs; exact finite WIFI_PS_NONE MAC stop/idle/restart and REGDMA-link-four transcription. The original archive was deleted after promotion, but this channel-restart leaf was not wired into the live HIL until the open STA timeout investigation.</source>
      <source id="HIL_OPEN_REGDMA_LINK4_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs switch_channel_with_mac_restart on ESP32-S31 rev0, psram-code-psram-data profile, 2026-07-29. An exact working vendor pre-auth snapshot read 0x2010d83c=0x080801ff (ACTIVE_LINK=4), while the failing open path read 0x080001ff (ACTIVE_LINK=0). Restoring the complete ic_mac_init link-four tail produced first-attempt Authentication, Association, WPA2 and DHCP at the ordinary 80-quarter-dBm limit; 200/200 ICMP echoes completed with 0 percent loss and 4.539 ms average RTT. The accumulated open TX counters were 211 immediate successes, three recovered ACK retries, zero other failures and zero hardware timeouts.</source>
      <source id="BLOB_LIBPP_RX_POLICY">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac.o hal_mac_rx_set_policy and hal_mac_set_rxq_policy bodies plus if_hwctrl.o ic_set_rx_policy and ic_set_rx_policy_ubssid_check wrappers. The reachable queue-zero policy-five transaction was preserved in migration scan code and is HIL-qualified by the connected open STA path.</source>
      <source id="BLOB_LIBNET80211_WIFI_RX_POLICY">_oracles/libnet80211.a sha256 92550813de20ed0d51110dbd72b646e891a86a8a2f81fa53714ebf2ebf9c8f40; complete ieee80211_supplicant.o wifi_set_rx_policy parent and jump table. Case five ends with ic_set_rx_policy_ubssid_check(0,false); case six ends with ic_set_rx_policy_ubssid_check(0,true). Register masks, addresses and ordered RMW edges come from the complete libpp HAL leaves.</source>
      <source id="IEEE80211_HT_SIG">IEEE Std 802.11 HT-SIG field layout: HT-SIG1 bit 7 is CBW, with zero selecting 20 MHz and one selecting 40 MHz. This standard semantic is joined only to the instruction-exact descriptor-word1-bit-15 mapping proved by BLOB_LIBPP_HAL_MAC_TX.</source>
      <source id="BLOB_LIBPP_HAL_MAC_TX">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_tx.o mac_tx_set_plcp0, hal_mac_tx_config_timeout, hal_mac_tx_set_ppdu, hal_mac_tx_config_edca, hal_mac_txq_enable, hal_mac_txq_disable, hal_mac_get_txq_state, hal_mac_clr_txq_state and hal_mac_get_txq_complete bodies; complete lmac.o lmacProcessTxSuccess; complete trc.o rcUpdateTxDone and rcUpdateAckSnr; complete pp.o ppTxProtoProc and mac_tx_set_pti bodies.</source>
      <source id="BLOB_LIBPP_HAL_HE_TX">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete hal_mac_tx.o mac_tx_set_hesig size 0x324, hal_mac_tx_set_ppdu HE branch, mac_tx_set_plcp0/mac_tx_set_plcp1 and mac_tx_set_len, plus complete hal_mac_ctl.o hal_he_get_bss_color, hal_he_set_tx_protection and hal_he_set_htc. This graph proves the two reverse-stride HE SU vector stores, repeated descriptor-count and protection fields, length-control store and HE power-pair selection.</source>
      <source id="BLOB_LIBNET80211_HE_CONTROL_TX">_oracles/libnet80211.a sha256 92550813de20ed0d51110dbd72b646e891a86a8a2f81fa53714ebf2ebf9c8f40; complete ieee80211_he.o ieee80211_encap_esfbuf_htc size 0x86 and complete ieee80211_output.o ieee80211_set_tx_desc/ieee80211_encap_esfbuf call graph. The HE QoS/TID path sets Frame Control Order bit 15 without reserving or moving four DMA bytes. An explicit pending OMC additionally writes the descriptor HE-Control word at offset 0x3c and sets descriptor-state bit 16; otherwise the software override stays clear for hardware-generated control such as BSR. _oracles/libpp.a complete hal_mac_tx.o hal_mac_tx_set_ppdu forwards those descriptor fields to hal_he_set_htc after mac_tx_set_hesig. Complete pp_he.o ppCalSubFrameLength independently proves the four-byte metadata accounting used by hardware insertion.</source>
      <source id="HIL_VENDOR_HE_CONTROL_INSERTION_2026_07_30">../esp32s31_rust/firmware/esp32s31/app/src/bin/wifi_sta.rs wifi-sta-auth-probe on ESP32-S31 rev0 with the complete vendor driver and Android shiva HE20/WPA2 AP, captured in /tmp/vendor-he-control-oracle-20260730.log and /tmp/vendor-he-control-oracle-air-20260730.pcapng. The synchronous post-formatter snapshot captured descriptor rate 35, Order set in DMA Frame Control, no four-byte placeholder before CCMP, metadata word one 0x01000000, software HE-Control disabled, and APEP length 0x76. Air frames 11 and 58 carried hardware BSR HE-Control 0x0404320f followed by intact CCMP. Frame 113 independently carried BSR 0x0303004f followed by intact CCMP. Complete _oracles/libpp.a[pp_he.o] ppCalSubFrameLength reads metadata byte seven bit zero from 0x01000000 and adds exactly four to the assembled subframe, while the low fourteen-bit metadata MPDU length remains unchanged. Earlier open frame 3010 in /tmp/open-radio-android-arp-air-20260730.pcapng omitted this metadata bit and corrupted the CCMP boundary; a temporary DMA placeholder restored length but was not vendor-equivalent.</source>
      <source id="HIL_OPEN_HE_CONTROL_METADATA_2026_07_30">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs open-radio-phy-prelude-hil on ESP32-S31 rev0 with the complete open PHY/MAC, standard psram-code-psram-data profile and Android shiva HE20/WPA2 AP on channel 6, captured in /tmp/open-radio-he-control-metadata-ch6-20260730.log and /tmp/open-radio-he-control-metadata-ch6-air-20260730.pcapng. The Rust A-MPDU builder kept CCMP immediately after the 26-byte QoS header, left the low fourteen-bit DMA MPDU length unchanged and set metadata byte seven bit zero. The driver completed WPA2, its first protected ARP on attempt one, immediate static-address network bring-up, and the first HE20 MCS9 aggregate with 32 of 32 MPDUs acknowledged on attempt one. Air frame 843, repeated as frame 78088 after a clean reset, contained Frame Control 0x88c1, QoS 0x0000, hardware BSR HE-Control bytes 4f 00 03 03, then intact CCMP bytes 09 00 00 20 00 00 00 00; tshark decrypted it as the expected ARP request. Eight subsequent ICMP replies likewise carried hardware BSR, decrypted successfully and had no retries or packet loss. This independently hardware-qualifies the vendor-equivalent metadata contract and rules out a software DMA placeholder.</source>
      <source id="BLOB_LIBPP_HE_DCM">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete trc.o rcGetDCMMaxRate and he_get_min_subframe_len_dcm bodies plus their RU26, RU52, RU106 and RU242 rate tables. rcGetDCMMaxRate maps the peer receive-constellation bound to BCC DCM MCS0, MCS1 or MCS3. For RU242 the 100-kbit/s rate rows for GI 0.8, 1.6 and 3.2 us are respectively [43,86,0,172,258], [40,81,0,163,244] and [36,73,0,146,219]. he_get_min_subframe_len_dcm combines these tables with ROM global s_ht_ampdu_density_us, whose rev0 default at 0x2f07fc5a is eight microseconds: it computes scaled=(rate_100kbps*density_us)&gt;&gt;3 and minimum_bytes=scaled/10+(scaled%10!=0), then stores the u16 result in the GI-by-MCS density table.</source>
      <source id="BLOB_LIBPP_HE_DELIMITER_SPACING">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete pp_he.o ppCalDeliNum size 0xac, ppCalSubFrameLength size 0x3e and ppEmptyDelimiterLength size 0x22; complete trc.o rcUpdateAMPDUParam size 0xde and ordinary/DCM HE minimum-subframe builders; complete hal_mac_tx.o mac_tx_set_hesig size 0x324. rcUpdateAMPDUParam maps the eight negotiated density encodings through integer microseconds [0,1,1,1,2,4,8,16]. ppCalDeliNum selects the GI, HE MCS and DCM-specific minimum complete subframe byte count, stores it at descriptor offset 0x28, and writes ceil((minimum-current)/4) to private DMA metadata byte four when round4(PSDU)+delimiter is shorter. ppCalSubFrameLength adds those four-byte empty delimiters to non-final aggregate accounting; ppEmptyDelimiterLength removes final padding and empty delimiters. mac_tx_set_hesig copies the descriptor offset-0x28 halfword into all three ten-bit queue PROTECTION lanes. The length metadata and PROTECTION value are therefore two outputs of the same rate/density policy and must not be configured independently.</source>
      <source id="BLOB_LIBPP_HE_AMPDU_LIMIT">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete pp_he.o ppCheckTxHEAMPDUlength size 0x258, pp_he.o get_estimated_batime size 0x1a, and trc.o rx11AXRate2AMPDULimit plus rx11AXRate2AMPDULimit_update size 0x136. The checker calls ppCalSubFrameLength for the candidate and rejects or stops accumulation when it exceeds the u16 limit selected by AC profile, GI/LTF and MCS. It halves that limit when descriptor-state word offset 0x30 bit 15 selects DCM. A zero EDCA TXOP copies ROM_REV0_HE_MAX_APEP into the selected profile. For a nonzero TXOP in 32-us units the producer generates three by ten values using duration_us=txop*32-36, estimated BlockAck times [68,44,44,32,32,32,32,32,32,32] us, preambles [31.2,32,40] us, symbol times [13.6,14.4,16] us, RU242 data bits per symbol [117,234,351,468,702,936,1053,1170,1404,1560], a minus-22 service/tail-bit term and final division by eight. The four AC profiles together occupy 120 u32 entries.</source>
      <source id="ROM_REV0_HE_MAX_APEP">_oracles/esp32s31_rev0_rom.elf sha256 a52ad7513deb656a910a5740125f1cce2c7941f11ce57213b7b43aea93d5ab87; complete 120-byte he_max_apep_length object at 0x2f84fd40. Its three GI rows by ten MCS columns are [3700,7400,11100,14800,22500,30000,33600,37600,45000,50000], [3500,7000,10500,14000,21000,28200,31500,35200,42300,47000], and [3200,6400,9600,12800,19000,25200,28700,32000,37800,42000]. Complete BLOB_LIBPP_HE_AMPDU_LIMIT maps both 0.8-us GI selectors to row zero and consumes these values as u16 APEP byte ceilings.</source>
      <source id="BLOB_LIBNET80211_RAW_TX_RATE_CONFIG">_oracles/libnet80211.a sha256 92550813de20ed0d51110dbd72b646e891a86a8a2f81fa53714ebf2ebf9c8f40; complete ieee80211_api.o esp_wifi_config_80211_tx and ieee80211_output.o esp_wifi_80211_tx. The public configuration copies a 12-byte phymode/rate/ERSU/DCM record through ic_set_80211_tx_rate_config. Only the raw 802.11 submission path reads that record: for phymode six it selects the HE descriptor branch, copies the configured rate to descriptor+0x0c and copies DCM to descriptor+0x31 bit 7. This API is therefore not an oracle for ordinary STA data rate-control packets unless a raw frame is explicitly submitted.</source>
      <source id="IEEE80211_HE_PHY_CAP_DCM">IEEE 802.11 HE PHY Capabilities byte three field semantics as exposed by Linux include/linux/ieee80211-he.h: bits 1:0 encode DCM maximum TX constellation and bits 4:3 encode DCM maximum RX constellation, with encodings NotSupported, BPSK, QPSK and 16-QAM.</source>
      <source id="BLOB_LIBPP_PP_HE_AMPDU_LENGTH">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete pp_he.o ppCalTxHEAMPDULength size 0x3e2 and ppCalSubFrameLength size 0x3e. ppCalSubFrameLength rounds the low fourteen-bit DMA MPDU length, adds delimiter and empty-delimiter terms, then adds four when metadata byte seven bit zero is set. The final assembled A-MPDU byte count is stored at pTxRx[logical_queue]+0x44; complete mac_tx_set_hesig later shifts that exact value by eleven into HE_SU_SIGNAL_A2_LENGTH.</source>
      <source id="BLOB_LIBPP_PP_HE_SMPDU_LENGTH">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete pp_he.o ppCalTxHESMPDULength size 0x58 and ppCalSubFrameLength size 0x3e. ppCalTxHESMPDULength rounds the low-twenty-bit DMA metadata payload length to four bytes, calls ppCalDeliNum and ppCalSubFrameLength, sets descriptor byte 0x32 bit two, sets frame byte 0x26 to one and descriptor byte 0x2a to one. ppCalSubFrameLength computes round4(payload_length)+4*(metadata_byte4+1)+4*(metadata_byte7&amp;1). The live vendor raw frame supplies payload_length 28 for the 24-byte MPDU plus hardware FCS, metadata byte4 zero and byte7 zero, yielding the qualified 32-byte HE S-MPDU APEP.</source>
      <source id="ESP_WIFI_SYS_S31_HE_SU_SIG">Sibling esp-wifi-sys commit 72b97e6fe55307aa92c8c1edf3fdb3f4df816e80, c/headers/esp32s31/esp_private/esp_wifi_he_types_private.h complete esp_wifi_su_siga1_t and packed esp_wifi_su_siga2_t layouts. These standard field names are joined only to bit positions independently exercised by the complete S31 blob formatter.</source>
      <source id="HIL_VENDOR_HE20_MCS9_SU_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/bin/wifi_sta.rs wifi-sta-auth-probe on ESP32-S31 rev0 with the complete vendor driver and a nearby FRITZ!Box HE20 WPA2 BSS, 2026-07-29. The probe replaced pp_wdev_funcs callback slot 0xec, called the original formatter and synchronously copied all four queue-control words, 31 vector words and descriptor inputs before queue enable. Two MCS9 uplink A-MPDU captures returned descriptor rate 35 and flags 0xc0403009. APEP length 0x76 produced PLCP1 0x04083000, HE A1 0xfc205b4f or 0xfc605b4f as GI/LTF changed, HE A2/length 0x1003b105, power 0x05050505, counts 0x00004081 and length control 0x00400244. The subsequent vendor throughput path reported HE A1 0xfc205b4f and HE A2/length 0x1030d105, independently proving APEP length 0x061a. The public fixed-rate request value and live descriptor rate are both 35; certification-test value 0x29 belongs to a separate domain.</source>
      <source id="HIL_VENDOR_HE20_MCS0_DCM_RAW_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/bin/wifi_sta.rs wifi-sta-auth-probe on ESP32-S31 rev0 with the complete vendor driver and a controlled AX211 HE20 WPA2 BSS, 2026-07-29. After HE association, esp_wifi_config_80211_tx accepted phymode six, public rate 26/MCS0/GI800 and DCM true. A deliberately submitted 24-byte non-QoS raw data frame then traversed the only blob consumer of that configuration. Synchronous interposition captured descriptor flags 0xc0407008, rate 0x1a, PLCP0 0x01631630, PLCP1 0x0401a000, HE-SIG-A1 0xfc204087, HE-SIG-A2 0x00010105, power 0x05050505 and LENGTH_CONTROL 0x004002c4. Its DMA descriptor word 0xc0090040 encoded capacity 64 and used length 36; the buffer began with metadata 0x0100001c followed by a 24-byte MPDU and a four-byte hardware-FCS slot. The vendor completion callback subsequently reported rate 26 and status zero, qualifying ordinary ACK reception. This distinguishes explicit DCM from rcGetDCMMaxRate fallback codes 0x10/0x11/0x13.</source>
      <source id="HIL_OPEN_HE20_MCS0_DCM_SMPDU_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, standard psram-code-psram-data profile with complete open PHY and MAC, controlled AX211 HE20 WPA2 AP on channel 11, 2026-07-29. After open scan, HE association, WPA2 and DHCP, the typed owner submitted one 24-byte non-QoS HE20 BCC DCM MCS0 S-MPDU using the exact bounded vendor DMA layout. Hardware completion returned status zero, proving ordinary ACK reception. The synchronous queue snapshot carried rate 0x1a, PLCP0 format one at 0x01636230 with only the live descriptor-address bits differing from vendor, PLCP1 0x0401a000, HE-SIG-A1 0xfc204087, HE-SIG-A2 0x00010105, power 0x14141314 and LENGTH_CONTROL 0x004002c4. The immediately following two-MPDU DCM A-MPDU retained status five and no BlockAck for all three supported GI/LTF profiles, localizing the remaining DCM failure to aggregate construction or BA handling rather than PHY, power, HE-SIG or DCM coding.</source>
      <source id="HIL_OPEN_HE20_MCS0_DCM_AMPDU_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, standard psram-code-psram-data profile with complete open PHY and MAC, and a nearby OnePlus IN2023 Android-13 HE20 WPA2 SoftAP on channel 11, 2026-07-29. Android reported Ieee80211axEnabled=true; the association HE PHY capability advertised BPSK DCM receive, and the open path completed WPA2, protected RX and DHCP before the probe. A separate typed MCS0 DCM S-MPDU first received an ordinary ACK. The matrix then used valid minimum Ethernet bodies so the exact zero-TXOP ROM APEP table, blob DCM-halving branch and owned delimiter/MPDU/MIC/FCS accumulator admitted real multi-subframe aggregates: 30 MPDUs at 2xLTF/0.8 us, 29 at 2xLTF/1.6 us and 26 at 4xLTF/3.2 us. The first 30-MPDU aggregate completed with status zero, acknowledged all 30 sequence numbers and required one attempt. Twenty-seven complete bounded rounds, each containing 64 aggregates at every supported GI/LTF profile, reported zero failed profiles and zero terminal retry failures. This qualifies BPSK DCM S-MPDU and multi-subframe A-MPDU TX, APEP bounding, BlockAck and aggregate retry; the peer did not advertise QPSK or 16-QAM DCM receive, so MCS1 and MCS3 remain unqualified.</source>
      <source id="HIL_OPEN_HE20_MCS9_AMPDU_2026_07_29">../esp32s31_rust open-radio-phy-prelude-hil on ESP32-S31 rev0 and the same nearby FRITZ!Box HE20 WPA2 BSS, 2026-07-29. The fully open PHY/MAC path associated as HE20, installed the recovered HE peer state, then published selector-one GI/LTF, descriptor rate 0x23/MCS9 and 32 owned CCMP MPDUs through the typed HE queue program. The first aggregate completed with status zero and a full BlockAck bitmap 0x00000000ffffffff on its first attempt. A sustained raw-MAC run exceeded 13,800 aggregates with tx_ampdu_partial zero, RX dropped zero and five-second Ethernet-payload windows of 83.6 to 87.5 Mbit/s. This qualifies the complete bounded HE SU q0 image and its ordered PAC publication, not OFDMA, DCM, LDPC, STBC or beamforming.</source>
      <source id="HIL_OPEN_HE20_STBC_NSTS_2026_07_30">../esp32s31_rust firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, standard psram-code-psram-data profile, fully open PHY/MAC against the nearby FRITZ!Box HE20 WPA2 BSS, 2026-07-30. During a controlled 10-Mbit/s UDP downlink the RX owner captured HE-SIG-A1 0x00e0591b and HE-SIG-A2 0x4a0c for HE-SU MCS3, and later 0x00a0594b/0x520c for MCS9. Both vectors set STBC and encode bits 25:23 as one. Because the S31 is 1T1R, this is two space-time streams generated from one spatial stream and independently disproves the previous unconditional spatial_streams_minus_one label.</source>
      <source id="HIL_OPEN_HE20_MCS9_EMPTY_DELIMITERS_2026_07_29">../esp32s31_rust open-radio-phy-prelude-hil on ESP32-S31 rev0, standard psram-code-psram-data profile, complete open PHY and MAC, controlled AX211 HE20 WPA2 AP on channel 11, 2026-07-29. A deterministic 32-MPDU protected-QoS aggregate used 54-byte PSDUs, HE20 MCS9, 2xLTF/0.8-us GI and an explicit 16-us density. Complete blob arithmetic produced minimum subframe length 230, 43 empty four-byte delimiters after every non-final MPDU and APEP length 7250. Keeping the old fixed queue PROTECTION value 0x31 produced completion status four and zero acknowledged MPDUs after four attempts. Changing only all three PROTECTION lanes to 230 produced status zero, a first-attempt BlockAck bitmap 0x00000000ffffffff and then more than 13,000 acknowledged MPDUs without final retry failure. This A/B HIL qualifies metadata-byte-four delimiter generation, final-tail APEP accounting and the descriptor-offset-0x28 to PROTECTION-lane mapping together.</source>
      <source id="BLOB_LIBPP_TRC_AMPDU_PARAM">_oracles/libpp.a sha256 f863c65c3ed89cf5d2a2cbe0d6bca3b783ca35788a704bb68e13958e4b94958e; complete trc.o rcUpdateAMPDUParam body, size 0xde. For non-HE HT peer types it maps HT A-MPDU Parameters bits 1:0, the maximum-length exponent, to byte ceilings 0x1fff, 0x3fff, 0x7fff and 0xffff, and maps minimum MPDU start-spacing code 0..4,5,6,7 to finite hardware values 20,40,76,148 stored at peer-state offset 0x82. Complete pp.o ppCheckTxAMPDUlength compares the accumulated aggregate against that peer byte ceiling. Complete hal_mac_tx.o mac_tx_set_htsig, size 0x23c, reads the spacing halfword and copies it into bits 9:0, 19:10 and 29:20 of the ordinary queue PROTECTION word through three fresh-read RMW edges.</source>
      <source id="HIL_VENDOR_ACTIVE_HT_VECTOR_2026_07_29">../esp32s31_rust firmware wifi-sta-auth-probe on ESP32-S31 rev0 with the complete vendor driver and a controlled Linux WPA2 HT20 AP, 2026-07-29. The probe polled all four queue owners and copied the complete 31-word vector plus four control words before logging only while PLCP0 format two was hardware-owned. The coherent HT queue contained PROTECTION=0x0280a028 and HT_DESCRIPTOR_COUNTS=0x00004081. The former is exactly three copies of negotiated spacing value 40; the latter is three copies of descriptor count one. This distinguishes the two physical registers and HIL-qualifies the complete blob field mapping.</source>
      <source id="HIL_VENDOR_HT20_MCS0_SINGLE_PPDU_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/bin/wifi_sta.rs wifi-sta-auth-probe on ESP32-S31 rev0 with the complete vendor driver and a controlled Linux WPA2 HT20 AP, 2026-07-29. After connection the probe replaced pp_wdev_funcs callback slot 0xec, called the original executable SRAM formatter thunk and copied the queue image synchronously before returning. Complete ROM lmacSetTxFrame at 0x2f835590..0x2f8355ae reaches that callback; complete ROM hal_mac_tx_set_ppdu is at 0x2f8352bc. A fixed-rate MCS0 non-A-MPDU frame of length 0x6e returned descriptor flags 0x00003009, PLCP0 control 0x016312fc before ownership publication, PLCP1 0x02090000, HT_SIGNAL 0x07006e00, DATA_LENGTH 0x0000006e, LENGTH_CONTROL 0x000002c4, HT_DESCRIPTOR_COUNTS 0x00004081 and PROTECTION 0x0280a028. This exact synchronous single-MPDU image distinguishes PLCP format one and entry class zero from the earlier active MCS7 A-MPDU image, which used format two and entry class one.</source>
      <source id="HIL_VENDOR_HT_AMPDU_PPDU">Earlier ESP32-S31 complete-vendor HIL final-link wrappers around ppAssembleAMPDU and hal_mac_tx_set_ppdu, retained in docs/esp32s31-async-boundaries.md. A two-MPDU HT20 MCS7/SGI chain had aggregate length 0x0c2e, QoS sequences 0x014/0x015, first descriptor flags 0x004c2009 after assembly, PLCP format two, HT_SIGNAL 0x8f0c2e07, DATA_LENGTH 0x70400c2e and LENGTH_CONTROL 0x00400244. A separate six-MPDU capture proved aggregate byte accounting and descriptor-count publication. The oracle-only vendor/RTOS run reached about 53.4 Mbit/s UDP; this source qualifies the finite aggregate formatter and topology, not the current open-driver throughput.</source>
