ermacv/open-esp-radio-rs/svd/esp32s31-radio.svd
      <source id="HIL_OPEN_HT_AMPDU_DIRECT_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, standard psram-code-psram-data profile with ISR and DMA audited in internal SRAM, complete open PHY and MAC, controlled Linux WPA2 AP on channel 11 HT40-, 2026-07-29. The Rust STA initiated a TID-0 immediate BlockAck agreement with window four, retained separate pinned storage for single and aggregate submission, and transmitted four observed two-MPDU A-MPDUs at HT40 MCS7 SGI. Every completion reported both submitted sequence bits through a BlockAck bitmap ending in 0x000f, with zero aggregate hardware timeouts. The same run continued using the single-MPDU path whenever only one network frame was queued. This qualifies the open direct-DMA descriptor head, PLCP format two, aggregate HT-SIG/length class, descriptor-count two and BlockAck-before-completion-clear ordering; it does not yet qualify partial-BlockAck retry or a throughput ceiling.</source>
      <source id="HIL_OPEN_HT_AMPDU_32_RETRY_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, standard psram-code-psram-data profile with ISR and DMA audited in internal SRAM, complete open PHY and MAC, controlled Linux WPA2 AP on channel 11 HT40-, 2026-07-29. The peer HT A-MPDU parameter byte was 0x17, maximum-length exponent three. Applying the complete rcUpdateAMPDUParam mapping allowed the open owner to submit 32 full-size MPDUs totaling 48,448 aggregate bytes; the first completion returned starting sequence 2717 and bitmap 0x00000000ffffffff. PTI remained 0x00111110, proving its count one is independent of the 32 values in HT_DESCRIPTOR_COUNTS. Replacing individual missing-MPDU retries with the ppResortTxAMPDU-compatible retained retry aggregate reduced partial original submissions from 352/1044 to 50/2748 and raised HT40 MCS7 LGI UDP enqueue throughput from 38-41 to 49.6-55.2 Mbit/s. HT40 MCS7 SGI then produced 53.1-59.3 Mbit/s and Linux independently reported RX bitrate 150.0 Mbit/s MCS7 40MHz short GI. No aggregate hardware timeout occurred.</source>
      <source id="HIL_OPEN_HT_AMPDU_RAW_CADENCE_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, standard psram-code-psram-data profile, complete open PHY and MAC, controlled Linux WPA2 AP on channel 11 HT40-, 2026-07-29. A raw protected-QoS profile retained real CCMP, Sequence Control, DMA, 30-MPDU A-MPDU and BlockAck handling but removed Embassy UDP/IP production. It delivered 63.6-76.8 Mbit/s of 1472-byte Ethernet payload at MCS7 40MHz short GI. Across 3811 original aggregates, cadence averaged 5194 us per original and 3201 us from each hardware-submit edge to completion; 5087 aggregate attempts give 1.335 attempts per original. This matches the separately retained vendor direct-TX range 59.3-75.5 Mbit/s and localizes the remaining 100-Mbit/s gap to serialized preparation/completion plus missing-BlockAck retries rather than the former 21-MPDU byte ceiling.</source>
      <source id="HIL_OPEN_HT_SINGLE_EXTREMES_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, standard psram-code-psram-data profile with ISR and DMA audited in internal SRAM, complete open PHY and MAC, controlled Linux WPA2 AP on channel 11. HT20 MCS0 LGI completed first-attempt Authentication, Association, WPA2 and DHCP; 200/200 ICMP replies completed at 2.483-ms average RTT, while the open TX counters recorded 210 immediate successes, two recovered ACK retries, zero other failures and zero hardware timeouts over 212 attempts. HT40 MCS7 SGI then negotiated 150 Mbit/s in both directions; 500/500 ICMP replies completed at 2.203-ms average RTT, while open TX recorded 510 immediate successes and two recovered ACK retries over 512 attempts. These are single-MPDU results. They hardware-qualify PLCP format one and both extreme MCS/CBW/GI encodings; they do not qualify the separate A-MPDU constructor.</source>
      <source id="MIGRATION_LMAC_TX">Git parent of migration-promotion commit f233006, migration/esp32s31-hybrid-runtime/src/lmac.rs; exact ESP32-S31 queue-bank address/stride transcription and async timeout/completion path later promoted into crates/esp32s31/wifi/mac/src/tx.rs. Existing open authentication and connected-network HIL qualify the ordinary queue-zero path.</source>
      <source id="HIL_OPEN_RX_LIVE_APPEND_2026_07_27">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs run_connected_network on ESP32-S31 rev0, psram-code-psram-data profile, 2026-07-27; rotating 32-entry ring survived more than 7000 receives and completed open scan, WPA2, DHCP and 5/5 ICMP echo with zero loss</source>
      <source id="HIL_OPEN_AUTH_PLCP_FORMAT_2026_07_28">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on connected ESP32-S31 rev0, open PHY and MAC, 2026-07-28. Controlled A/B kept the 30-byte authentication MPDU, descriptor, PLCP1 0x22, power, rate, channel and RX policy fixed. Format one yielded completion status five with no response; format zero yielded status zero and one addressed authentication response, but later format-zero repetitions failed. Earlier repeated format-one runs had completed authentication through DHCP. Therefore this experiment proves that TX completion status is not by itself a protocol-success oracle; it does not supersede the instruction-exact mac_tx_set_plcp0 mapping.</source>
      <source id="HIL_VENDOR_STA_AUTH_POLICY_2026_07_28">../esp32s31_rust firmware wifi-sta-auth-probe on ESP32-S31 rev0 with the complete vendor driver, 2026-07-28. The first Open Authentication TX capture showed queue-zero RX filter 0x0001c387. This exactly matches wifi_set_rx_policy jump-table case six, including UBSSID-policy bits 8 and 1 set; the vendor station then associated, completed WPA2 and obtained DHCP. Applying only these two bits to the open driver reproduced the register image but did not independently cure its intermittent TX status-five/authentication timeout.</source>
      <source id="HIL_OPEN_TX_POWER_CONNECTIVITY_2026_07_28">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, psram-code-psram-data, open PHY and MAC, 2026-07-28. With the HIL API limit 80 quarter-dBm and resulting ordinary queue power code 20, three consecutive reset-to-network runs completed Authentication and Association on their first MAC attempts, WPA2 and DHCP. A host test then received 200 of 200 ICMP replies with 4.613 ms average RTT; the device observed four raw ACK timeouts among 215 attempts and recovered all four by retrying the same encoded MPDU. With limit 20 quarter-dBm and resulting code 5, repeated runs included complete twelve-attempt Authentication failures. This is connectivity evidence for the current open profile, not proof that the open and vendor power/gain-table encodings are equivalent; the complete vendor driver also succeeds with queue code 5, so that mismatch remains localized for investigation.</source>
      <source id="HIL_OPEN_LEGACY_RTS_RATE_2026_07_29">../esp32s31_rust/firmware/esp32s31/app/src/open_radio_phy_prelude_hil.rs on ESP32-S31 rev0, psram-code-psram-data, open PHY and MAC, controlled Linux WPA2 AP on channel 11 HT40-, 2026-07-29. Before the vendor basic-rate mapping, fixed 54-Mbit/s data with LENGTH_CONTROL incorrectly carrying rate 54 lost 25 to 39 percent of ICMP samples. Fixed 6M and 24M each completed 200/200, while 48M completed 199/200. After restoring complete mac_tx_get_rts_rate semantics so 54M publishes basic rate 24M and derives RTS power separately, 54M completed 197/200 followed by 495/500, with 1.975-ms and 2.353-ms average RTT. Linux reported the station RX bitrate as 54.0 Mbit/s, five AP-side TX retries and one AP-side TX failure over 709 packets. This qualifies the rate-dependent LENGTH_CONTROL field and strongly localizes the former loss to the wrong basic-rate image.</source>
    </openEspRadioProvenance>
    <openEspRadioAddressWindows source="S31_REG_BASE">
      <window name="MODEM_RADIO_CORE" start="0x20100000" endExclusive="0x20200000"/>
      <window name="HP_SYSTEM" start="0x20500000" endExclusive="0x20600000"/>
      <window name="LP_SYSTEM" start="0x20700000" endExclusive="0x20800000"/>
      <window name="LP_PERIPHERAL" start="0x20800000" endExclusive="0x20900000"/>
    </openEspRadioAddressWindows>
    <openEspRadioEvidenceRanges source="BLOB_LIBPHY_PHY_DEBUG_REG_CHECK">
      <range name="FECOEX" start="0x20100000" endExclusive="0x20100058"/>
      <range name="FEDATA" start="0x20100400" endExclusive="0x2010048c"/>
      <range name="FECTRL" start="0x20100800" endExclusive="0x201008e4"/>
      <range name="FEDATA_WIFI" start="0x20100c00" endExclusive="0x20100c58"/>
      <range name="BTMAC" start="0x20101400" endExclusive="0x20101fb8"/>
      <range name="BT_V3_2" start="0x20102000" endExclusive="0x20102200"/>
      <range name="BTAGC" start="0x20102800" endExclusive="0x2010290c"/>
      <range name="ZBBB" start="0x20102c00" endExclusive="0x20102c4c"/>
      <range name="IEEE802154_REG" start="0x20103000" endExclusive="0x201031a4"/>
      <range name="AGC" start="0x20107000" endExclusive="0x2010720c"/>
      <range name="BBTX" start="0x20107400" endExclusive="0x20107480"/>
      <range name="NRX" start="0x20107800" endExclusive="0x20107a44"/>
      <range name="BB" start="0x20107c00" endExclusive="0x20107d50"/>
      <range name="BRX" start="0x20108000" endExclusive="0x2010809c"/>
    </openEspRadioEvidenceRanges>
  </vendorExtensions>
</device>
